{"luna":{"name":"Luna","date":1403668800,"projects":{"eclipse":{"id":"eclipse","name":"Eclipse Project","description":"\u003Cp\u003E\u003Cb\u003E\u003Ca href=\u0022http:\/\/www.eclipse.org\/eclipse\/\u0022\u003EThe Eclipse Top-Level Project\u003C\/a\u003E\u003C\/b\u003E - an open source, robust, full-featured, commercial-quality, industry platform for the development of highly integrated tools and \u003Ca href=\u0022http:\/\/wiki.eclipse.org\/RCP\/\u0022\u003Erich client applications\u003C\/a\u003E.\u003C\/p\u003E\r\n","download":"http:\/\/download.eclipse.org\/eclipse\/","website":"http:\/\/www.eclipse.org\/eclipse\/","overview":"http:\/\/projects.eclipse.org\/projects\/eclipse","offset":"0","new":false,"releases":[{"name":"4.4.0","description":"\u003Cp\u003EThis release brings full GTK+ 3 (where supported and successfully tested) and Java 8 support to Eclipse. It also improves performance and stability of the Platform user interface. For more details see the official \u003Ca href=\u0022http:\/\/www.eclipse.org\/projects\/project-plan.php?planurl=http:\/\/www.eclipse.org\/eclipse\/development\/plans\/eclipse_project_plan_4_4.xml\u0022\u003ELuna Plan\u003C\/a\u003E.\u003C\/p\u003E\r\n","subprojects":["eclipse.jdt","eclipse.pde","eclipse.platform","eclipse.jdt.core","eclipse.jdt.debug","eclipse.jdt.ui","eclipse.platform.debug","eclipse.platform.releng","eclipse.platform.resources","eclipse.platform.swt","eclipse.platform.text","eclipse.platform.ui"],"date":1403668800}]},"technology.recommenders":{"id":"technology.recommenders","name":"Eclipse Code Recommenders","description":"\u003Cp\u003EApplication frameworks have become an integral part of today\u0026#39;s software development - this is hardly surprising given their promised benefits such as reduced costs, higher quality, and shorter time to market. But using an application framework is not free of cost. Before frameworks can be used efficiently, software developers have to learn their correct usage which often results in high initial training costs.\u003C\/p\u003E\r\n\u003Cp\u003EEclipse Code Recommenders supports developers on learning new APIs by providing tools which learn correct API usages or valuable API usage patterns by analyzing example code and re-integrates this regained knowledge back into your IDE by means of intelligent code completion, extended javadocs and others...\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/recommenders\/download\/","website":"http:\/\/www.eclipse.org\/recommenders\/","overview":"http:\/\/projects.eclipse.org\/projects\/technology.recommenders","offset":"3","new":false,"releases":[{"name":"2.1.0","description":"\u003Cp\u003EThis release integrates the Snipmatch code snippet search engine (formerly an Incubator project of Eclipse Code Reocmmenders), which makes it easy to search for and insert code snippets provided by the community.\u003C\/p\u003E\r\n\u003Cp\u003EUnder the hood, the performance of loading recommendation models has been greatly improved.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.mdt.uml2":{"id":"modeling.mdt.uml2","name":"Eclipse MDT UML2","description":"\u003Cp\u003EUML2 is an EMF-based implementation of the UML\u003Csup\u003ETM\u003C\/sup\u003E 2.x metamodel for the Eclipse platform.\u003C\/p\u003E\r\n","download":"https:\/\/www.eclipse.org\/modeling\/mdt\/downloads\/?project=uml2","website":null,"overview":"http:\/\/projects.eclipse.org\/projects\/modeling.mdt.uml2","offset":"1","new":false,"releases":[{"name":"5.0.0","description":"\u003Cp\u003EThis release of UML2 is focused on compliance with the UML 2.5 specification and includes a number of enhancements to better support the community. The New and Noteworthy items for Luna are described \u003Ca href=\u0022http:\/\/wiki.eclipse.org\/MDT\/UML2\/New_and_Noteworthy\/Luna\u0022\u003Ehere\u003C\/a\u003E.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"rt.equinox":{"id":"rt.equinox","name":"Eclipse Equinox","description":"\u003Cp\u003EFrom a code point of view, Eclipse Equinox is an implementation of the\u0026nbsp;\u003Ca href=\u0022https:\/\/www.osgi.org\/developer\/downloads\/release-6\/\u0022\u003EOSGi R6 core framework specification\u003C\/a\u003E, a set of bundles that implement various optional OSGi services and other infrastructure for running OSGi-based systems.\u003C\/p\u003E\r\n\u003Cp\u003EMore generally, the goal of the Equinox project is to be a first class OSGi community and foster the vision of Eclipse as a landscape of bundles. As part of this, it is responsible for developing and delivering the OSGi framework implementation used for all of Eclipse. In addition. the project is open to:\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\tImplementation of all aspects of the OSGi specification (including the EEG, MEG and VEG work)\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tInvestigation and research related to future versions of OSGi specifications and related runtime issues\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tDevelopment of non-standard infrastructure deemed to be essential to the running and management of OSGi-based systems\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tImplementation of key framework services and extensions needed for running Eclipse (e.g., the Eclipse Adaptor, Extension registry) and deemed generally useful to people using OSGi.\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\u003Cp\u003EAs part of the RT project, the Equinox OSGi code is managed by the RT PMC. There is a close binding however to the Eclipse project and its PMC. Equinox, as the base for all of Eclipse, ships with all the major releases. The various other bundles developed here may ship independently and on different schedules.\u003C\/p\u003E\r\n","download":"http:\/\/download.eclipse.org\/equinox\/","website":"http:\/\/eclipse.org\/equinox","overview":"http:\/\/projects.eclipse.org\/projects\/rt.equinox","offset":"0","new":false,"releases":[{"name":"4.4.0","description":"\u003Cp\u003EThe Equinox 4.4 release continues to focus on implementing the latest Core OSGi specification and selected OSGi Compendium services. \u0026nbsp;The \u003Ca href=\u0022http:\/\/www.osgi.org\/Specifications\/Drafts\u0022\u003Efinal draft\u003C\/a\u003E of the OSGi Core specification (Release 6) became availabe in March 2014. \u0026nbsp;The Equinox 4.4 release includes a full implementation of the R6 Core Framework as well as several compendium service implementations. \u0026nbsp;Many of the Equinox specification implementations from this release are used as the Reference Implementations for the OSGi R6 specification. \u0026nbsp;\u003C\/p\u003E\r\n\u003Cp\u003E\u003Cspan style=\u0022font-size: 12px;\u0022\u003EThis release also includes a major refactoring and reimplementation of the Core Framework based on the generic OSGi dependency model. \u0026nbsp;Given the amount of significant changes this release the version of this release is being bumped up to 4.4.\u003C\/span\u003E\u003C\/p\u003E\r\n","subprojects":["rt.equinox.bundles","rt.equinox.framework","rt.equinox.p2","rt.equinox.security"],"date":1403668800}]},"technology.sapphire":{"id":"technology.sapphire","name":"Eclipse Sapphire","description":"\u003Cp\u003EEclipse Sapphire is a user interface development framework that improves productivity. Instead of focusing on individual widgets, layouts and data binding, the developers focus on modeling the semantics of the data and declaring the general intent of how the data it to be presented.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/sapphire\/downloads\/index.php","website":"http:\/\/www.eclipse.org\/sapphire\/","overview":"http:\/\/projects.eclipse.org\/projects\/technology.sapphire","offset":"3","new":false,"releases":[{"name":"8","description":"\u003Cp\u003EThe major focus of this release is API polish and general user experience improvements in preparation for graduation from incubation. This release is part of Luna.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.emf.cdo":{"id":"modeling.emf.cdo","name":"Eclipse CDO Model Repository","description":"\u003Cp\u003EThe Eclipse CDO (Connected Data Objects) Model Repository is a distributed shared model framework for EMF models and meta models. CDO is also a model runtime environment with a focus on orthogonal aspects like model scalability, transactionality, persistence, distribution, queries and more.\u003Cbr \/\u003E\r\n\t\u003Cbr \/\u003E\r\n\tCDO has a 3-tier architecture supporting EMF-based client applications, featuring a central model repository server and leveraging different types of pluggable data storage back-ends like relational databases, object databases and file systems. The default client\/server communication protocol is implemented with the Net4j Signalling Platform.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/cdo\/downloads","website":"http:\/\/www.eclipse.org\/cdo","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.emf.cdo","offset":"2","new":false,"releases":[{"name":"4.3.0","description":"\u003Cp\u003EThe CDO 4.3 release focuses on server-side \u003Ca href=\u0022http:\/\/eclip.se\/1t\u0022\u003Esecurity\u003C\/a\u003E and \u003Ca href=\u0022http:\/\/tinyurl.com\/lmh6xwa\u0022\u003Eadministration\u003C\/a\u003E, as well as better \u003Ca href=\u0022http:\/\/tinyurl.com\/kqozm5p\u0022\u003Eintegration\u003C\/a\u003E with EMF command stacks and transactional editing domains on the client-side.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"technology.scout":{"id":"technology.scout","name":"Eclipse Scout","description":"\u003Cp\u003E\u003Ca href=\u0022https:\/\/www.eclipse.org\/scout\u0022\u003EEclipse Scout\u003C\/a\u003E is a framework for business applications. Scout applications are based on Java and HTML5 and provide multi-device support to run on both mobile and tablet devices as well as in deskop browsers.\u003C\/p\u003E\r\n\u003Cp\u003E\u003Cimg alt=\u0022\u0022 src=\u0022https:\/\/wiki.eclipse.org\/images\/a\/ae\/Scout_neon_business_application.png\u0022 style=\u0022height: 302px;\u0022 \/\u003E\u003C\/p\u003E\r\n\u003Cp\u003ETo get started, start with the \u0026quot;Hello World\u0026quot; described in the \u003Ca href=\u0022https:\/\/www.eclipse.org\/scout\/\u0022\u003EScout home page\u003C\/a\u003E. Then, continue with the \u003Ca href=\u0022https:\/\/eclipsescout.github.io\/6.0\/beginners-guide.html\u0022\u003EBeginners Guide\u003C\/a\u003E. To read more about the technology behind Scout, check out the \u003Ca href=\u0022https:\/\/eclipsescout.github.io\/6.0\/technical-guide.html\u0022\u003ETechnical Guide\u003C\/a\u003E.\u003C\/p\u003E\r\n","download":"https:\/\/www.eclipse.org\/downloads\/eclipse-packages\/","website":"http:\/\/www.eclipse.org\/scout","overview":"http:\/\/projects.eclipse.org\/projects\/technology.scout","offset":"3","new":false,"releases":[{"name":"4.0.0","description":"\u003Cp\u003EScout 4.0 ships with initial support to build cloud based business applications. Otherwise, is mostly a bugfix release. Some notable API changes are introduced by the replacement of arrays in the framwork with typed lists.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"rt.rap":{"id":"rt.rap","name":"Eclipse Remote Application Platform","description":"\u003Cp\u003EThe Eclipse Remote Application Platform (RAP) is a framework for modular business applications that can be accessed from different types of clients including web browsers, rich clients, and mobile devices. It provides a powerful, multi-platform widget toolkit with SWT API that enables developers to write applications entirely in Java and re-use the same code on different platforms.\u003C\/p\u003E\r\n\u003Cp\u003ERegardless of the client platform, RAP applications run on a server that communicates with its clients over HTTP. Applications can therefore be deployed on any servlet container. With the RAP OSGi integration, they can be composed of modules and communicate using the OSGi service model.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/rap\/downloads\/","website":"http:\/\/eclipse.org\/rap","overview":"http:\/\/projects.eclipse.org\/projects\/rt.rap","offset":"2","new":false,"releases":[{"name":"2.3.0","description":"\u003Cp\u003EThe RAP project delivered the \u003Ca href=\u0022https:\/\/projects.eclipse.org\/projects\/rt.rap\/releases\/2.2.0\u0022\u003ERAP 2.2.0 release\u003C\/a\u003E in December 2013, and together with Eclipse Luna this RAP 2.3.0 release in June 2014. It includes server-side improvements, such as \u003Cem\u003Eroot path entry points\u003C\/em\u003E, HTTP post request start, a new API for \u003Cem\u003Eunique instances\u003C\/em\u003E (\u0026#39;Singletons\u0026#39; for UISessions and Applications), on the cliend-side a new implementation of the \u003Cem\u003E(C)Combo\u003C\/em\u003E and a JavaScript API for Widget HTML manipulation among other things. With the new e4 component in the RAP Incubator it is possible to run\u003Cem\u003E Eclipse 4 applications\u003C\/em\u003E with RAP.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"tools.ptp":{"id":"tools.ptp","name":"Eclipse Parallel Tools Platform (PTP)","description":"\u003Cp\u003EThe aim of the Eclipse Parallel Tools Platform project is to produce an open-source industry-strength platform that provides a highly integrated environment specifically designed for parallel application development. The project will provide a standard, portable parallel IDE that supports a wide range of parallel architectures and runtime systems; a scalable parallel debugger; support for the integration of a wide range of parallel tools; and an environment that simplifies the end-user interaction with parallel systems.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/ptp\/downloads.php","website":"http:\/\/www.eclipse.org\/ptp","overview":"http:\/\/projects.eclipse.org\/projects\/tools.ptp","offset":"2","new":false,"releases":[{"name":"8.0.0","description":"\u003Cp\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-family: Arial, Helvetica, sans-serif; line-height: 18px; \u0022\u003EThe Parallel Tools Platform project provides tools and frameworks for developing parallel programs for high performance computing. This includes tools for statically analyzing source code in order to locate programming errors and simplify the use of parallel programming models, remote tools for working on applications located on remote machines, a framework for running and monitoring applications on a broad range of target systems, a parallel debugger, and a framework for integrating dynamic analysis tools (such as performance analysis) with Eclipse.\u003C\/span\u003E\u003C\/p\u003E\r\n\u003Cp\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-family: Arial, Helvetica, sans-serif; line-height: 18px; \u0022\u003EPTP includes the Photran subproject, which builds on CDT to add Fortran support.\u003C\/span\u003E\u003C\/p\u003E\r\n\u003Cp\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-family: Arial, Helvetica, sans-serif; line-height: 18px; \u0022\u003EThis release focusses on improved usability and stability. It also includes a new remote API that will enable other projects to use remote services without dependencies on PTP.\u003C\/span\u003E\u003C\/p\u003E\r\n","subprojects":["tools.ptp.photran"],"date":1403668800}]},"tools.linuxtools":{"id":"tools.linuxtools","name":"Eclipse Linux Tools","description":"\u003Cp\u003EThe Linux Tools project aims to bring a full-featured C and C++ IDE to Linux developers. We build on the source editing and debugging features of the CDT and integrate popular native development tools such as the GNU Autotools, Valgrind, OProfile, RPM, SystemTap, GCov, GProf, LTTng, etc. Current projects include LTTng trace viewers and analyzers, an RPM .spec editor, Autotools build integration, a Valgrind heap usage analysis tool, and OProfile call profiling tools. The project also provides a place for Linux distributions to collaboratively overcome issues surrounding distribution packaging of Eclipse technology. The project produces both best practices and tools related to packaging. One of our features is a source archive of the Eclipse SDK that can be used by all Linux distributions building and distributing it.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/linuxtools\/downloads.php","website":"http:\/\/www.eclipse.org\/linuxtools\/","overview":"http:\/\/projects.eclipse.org\/projects\/tools.linuxtools","offset":"3","new":false,"releases":[{"name":"3.0.0","description":null,"subprojects":[],"date":1403668800}]},"tools.cdt":{"id":"tools.cdt","name":"Eclipse C\/C++ Development Tooling (CDT)","description":"\u003Cp\u003EThe Eclipse CDT Project provides a fully functional C and C++ Integrated Development Environment based on the Eclipse platform. Features include: support for project creation and managed build for various toolchains, standard make build, source navigation, various source knowledge tools, such as type hierarchy, call graph, include browser, macro definition browser, code editor with syntax highlighting, folding and hyperlink navigation, source code refactoring and code generation, visual debugging tools, including memory, registers, and disassembly viewers.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/cdt\/downloads.php","website":"http:\/\/www.eclipse.org\/cdt","overview":"http:\/\/projects.eclipse.org\/projects\/tools.cdt","offset":"1","new":false,"releases":[{"name":"8.4.0","description":"\u003Cp\u003ECDT 8.4 is a minor release that ships with the Luna simultaneous release.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"tools.windowbuilder":{"id":"tools.windowbuilder","name":"Eclipse WindowBuilder","description":"\u003Cp\u003EEclipse WindowBuilder is composed of Eclipse SWT Designer and Eclipse Swing Designer and makes it very easy to create Java GUI applications without spending a lot of time writing code. Use the WYSIWYG visual designer and layout tools to create simple forms to complex windows; the Java code will be generated for you. Easily add controls using drag-and-drop, add event handlers to your controls, change various properties of controls using a property editor, internationalize your app and much more.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/windowbuilder\/download.php","website":"http:\/\/www.eclipse.org\/windowbuilder\/","overview":"http:\/\/projects.eclipse.org\/projects\/tools.windowbuilder","offset":"3","new":false,"releases":[{"name":"1.7.0","description":"\u003Cdiv\u003E\r\n\tWe have the following major themes for our Luna release:\u003C\/div\u003E\r\n\u003Cp\u003E\u003Cstrong\u003EEnsure that WindowBuilder works great with Eclipse 4.4\u003C\/strong\u003E\u003C\/p\u003E\r\n\u003Cp\u003EAs the Luna simultaneous release is going to be based on Eclipse 4.4, WindowBuilder needs to work properly when installed as a feature in an Eclipse 4.4 IDE.\u003C\/p\u003E\r\n\u003Cp\u003E\u003Cstrong\u003EBetter support for non-Java UI frameworks\u003C\/strong\u003E\u003C\/p\u003E\r\n\u003Cp\u003EWindowBuilder needs to provide better support creating creating non-Java UI frameworks. The core Java support is built into the core WindowBuilder libraries and needs to be extracted into its own plugin. This will leave the core WindowBuilder API agnostic to language and make it much easier to create UI builders for non-Java UI frameworks.\u003C\/p\u003E\r\n\u003Cp\u003E\u003Cstrong\u003ECommunity support\u003C\/strong\u003E\u003C\/p\u003E\r\n\u003Cp\u003EThe WindowBuilder team needs to continue supporting users who wish to use WB to create their Swing and SWT user interfaces as well as developers wishing to use WB as a base for creating their own custom UI builders.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.ecoretools":{"id":"modeling.ecoretools","name":"Eclipse Ecore Tools","description":"\u003Cp\u003EThe Eclipse Ecore Tools component provides a complete environment to create, edit and maintain \u003Ca href=\u0022http:\/\/wiki.eclipse.org\/Ecore\u0022 title=\u0022Ecore\u0022\u003EEcore\u003C\/a\u003E\u0026nbsp;models. This component eases handling of Ecore models with a Graphical Ecore Editor and bridges to other existing Ecore tools (\u003Ca class=\u0022new\u0022 href=\u0022http:\/\/wiki.eclipse.org\/index.php?title=Validation\u0026amp;action=edit\u0022 title=\u0022Validation\u0022\u003EValidation\u003C\/a\u003E,\u0026nbsp;\u003Ca href=\u0022http:\/\/wiki.eclipse.org\/EMF_Search\u0022 title=\u0022EMF Search\u0022\u003ESearch\u003C\/a\u003E,\u0026nbsp;\u003Ca href=\u0022http:\/\/wiki.eclipse.org\/EMF_Compare\u0022 title=\u0022EMF Compare\u0022\u003ECompare\u003C\/a\u003E,\u0026nbsp;\u003Ca href=\u0022http:\/\/wiki.eclipse.org\/Emfatic\u0022 title=\u0022Emfatic\u0022\u003EEmfatic\u003C\/a\u003E, generators...). The Graphical Ecore Editor implements multi-diagram support, a custom tabbed properties view, validation feedbacks, refactoring capabilities...\u003C\/p\u003E\r\n\u003Cp\u003E\u003Cimg alt=\u0022Ecore Diagram Editor\u0022 src=\u0022http:\/\/wiki.eclipse.org\/images\/5\/56\/EcoreDiagramOverview_tmb.png\u0022 \/\u003E\u003C\/p\u003E\r\n","download":null,"website":"http:\/\/www.eclipse.org\/ecoretools\/","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.emft.ecoretools","offset":"3","new":false,"releases":[{"name":"2.0.0","description":"\u003Cp\u003EEcoreTools, the graphical modeler for Ecore, has been completely re-implemented based on Sirius and provides a nicer graphical design, support for documenting your model, specifying domain constraints and modeling Generic Types.\u003C\/p\u003E\r\n\u003Cp\u003EPlease note that \u003Cstrong\u003Emigrating the diagrams from EcoreTools 1.x to EcoreTools 2 is unlikely to be supported \u003C\/strong\u003Ebut anybody \u0026nbsp;wanting to add this support is welcome to and will have proper assistance.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"soa.stardust":{"id":"soa.stardust","name":"Eclipse Stardust","description":"\u003Cp\u003EThe Eclipse Stardust project is focused on providing a comprehensive Business Process Management Suite (BPMS) which covers all phases of the Business Process Lifecycle including modeling, simulation, execution and monitoring.\u003C\/p\u003E\r\n\u003Cp\u003EFor more information on the Stardust project, its features, architecture, usage and regarding possibilities to participate, please see \u003Ca href=\u0022http:\/\/wiki.eclipse.org\/Stardust\u0022\u003Ehttp:\/\/wiki.eclipse.org\/Stardust\u003C\/a\u003E.\u003C\/p\u003E\r\n","download":"http:\/\/wiki.eclipse.org\/Stardust\/Download","website":"http:\/\/www.eclipse.org\/stardust\/","overview":"http:\/\/projects.eclipse.org\/projects\/soa.stardust","offset":"3","new":false,"releases":[{"name":"2.0.0 (Luna)","description":"\u003Cp\u003EThe Stardust 2.0 Release, will emphasize enhancements in the following areas:\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\tEasier user access to runtime and system data (reporting, monitoring, diagnostics)\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tImprovements in the areas of browser based modeling and BPMN2 support\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tSupport for new runtime platform versions\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tMultiple minor fixes and enhancements to improve overall stability and ease of use.\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.tmf.xtext":{"id":"modeling.tmf.xtext","name":"Eclipse Xtext","description":"\u003Cp\u003EEclipse Xtext is a framework for development of programming languages and domain specific languages. It covers all aspects of a complete language infrastructure, from parsers, over linker, compiler or interpreter to fully-blown top-notch Eclipse IDE integration. It comes with good defaults for all these aspects and at the same time every single aspect can be tailored to your needs.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/Xtext\/download.html","website":"http:\/\/www.eclipse.org\/Xtext\/","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.tmf.xtext","offset":"2","new":false,"releases":[{"name":"2.6.0","description":"\u003Cp\u003EXtext 2.6 contains many bugfixes, performance improvements and new features, such as support for gradle, task tags and various enhancements to the Java support (Xbase).\u003C\/p\u003E\r\n\u003Cp\u003EXtend 2.6 contains many bugfixes, performance improvements and new features such as anonymous classes, inner classes, traditional for loops, synchronized blocks, open implementation, and many more.\u003C\/p\u003E\r\n","subprojects":[],"date":1400644800}]},"modeling.m2t.xpand":{"id":"modeling.m2t.xpand","name":"Eclipse Xpand","description":"\u003Cp\u003EXpand is language specialized on code generation based on EMF models. It supports the following main language features:\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\tPlugable Type System\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tDynamic Dispatch of Functions (a.k.a. extension methods)\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tBuilt-in support for AOP Rich Expressions (including higher order functions for collections)\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n","download":"http:\/\/www.eclipse.org\/modeling\/m2t\/downloads\/?showAll=0\u0026project=xpand","website":"http:\/\/www.eclipse.org\/modeling\/m2t\/xpand","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.m2t.xpand","offset":"2","new":false,"releases":[{"name":"2.0.0","description":"\u003Cp\u003EAlthough a major increment, this release will mainly be a maintenance release. Some seldomly used API might be changed.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.emf.mwe":{"id":"modeling.emf.mwe","name":"Eclipse Modeling Workflow Engine","description":"\u003Cp\u003EWelcome to the Modeling Workflow Engine wiki. the modeling workflow engine (MWE) supports orchestration of different Eclipse modeling components to be executed within Eclipse as well as standalone. Based on a dependency injection framework, one can simply configure and wire up \u0026#39;workflows\u0026#39; using a declarative XML-based language. The project provides the runtime used to execute workflows as well as the IDE tooling used to edit, start and debug them.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/modeling\/emft\/downloads\/?project=mwe","website":"http:\/\/www.eclipse.org\/modeling\/emft\/?project=mwe","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.emf.mwe","offset":"2","new":false,"releases":[{"name":"2.6.0","description":"\u003Cp\u003EThis is mostly a maintenance release.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"mylyn":{"id":"mylyn","name":"Eclipse Mylyn","description":"\u003Cp\u003EMylyn is a Task-Focused Interface for Eclipse that reduces information overload and makes multi-tasking easy. The mission of the\u0026nbsp;\u003Ca href=\u0022http:\/\/www.eclipse.org\/mylyn\u0022\u003EMylyn\u003C\/a\u003E\u0026nbsp;project is to provide:\u003C\/p\u003E\r\n\u003Col\u003E\r\n\t\u003Cli\u003E\r\n\t\tFrameworks and APIs for Eclipse-based task and Application Lifecycle Management (ALM)\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tExemplary tools for task-focused programming within the Eclipse IDE.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tReference implementations for open source ALM tools used by the Eclipse community and for open ALM standards such as OSLC\u003C\/li\u003E\r\n\u003C\/ol\u003E\r\n\u003Cp\u003EThe project is structured into sub-projects, each representing an ALM category and providing common APIs for specific ALM tools. The primary consumers of this project are ALM ISVs and other adopters of Eclipse ALM frameworks.\u0026nbsp;\u003C\/p\u003E\r\n\u003Cp\u003EPlease see the\u0026nbsp;\u003Ca href=\u0022http:\/\/wiki.eclipse.org\/Mylyn\/Charter\u0022\u003Eproject charter\u003C\/a\u003E\u0026nbsp;for more details.\u003C\/p\u003E\r\n\u003Cp\u003EMylyn makes tasks a first class part of Eclipse, and integrates rich and offline editing for repositories such as Bugzilla, Trac, and JIRA. Once your tasks are integrated, Mylyn monitors your work activity to identify information relevant to the task-at-hand, and uses this task context to focus the Eclipse UI on the interesting information, hide the uninteresting, and automatically find what\u0026#39;s related. This puts the information you need to get work done at your fingertips and improves productivity by reducing searching, scrolling, and navigation. By making task context explicit Mylyn also facilitates multitasking, planning, reusing past efforts, and sharing expertise.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/mylyn\/downloads\/","website":"http:\/\/www.eclipse.org\/mylyn\/","overview":"http:\/\/projects.eclipse.org\/projects\/mylyn","offset":"3","new":false,"releases":[{"name":"3.12","description":"\u003Cp\u003EThe Mylyn 3.12 release adds compatibility with Eclipse Luna and support for recent Bugzilla, Jenkins, and Gerrit versions. It also improves the configurability and extensibility of the tasks framework and includes a number of bug fixes and enhancements.\u003C\/p\u003E\r\n","subprojects":["mylyn.builds","mylyn.commons","mylyn.context","mylyn.docs","mylyn.reviews","mylyn.tasks","mylyn.versions"],"date":1403668800}]},"rt.gyrex":{"id":"rt.gyrex","name":"Eclipse Gyrex Project","description":"\u003Cp\u003EThe Gyrex project is an Eclipse Open Source project for creating OSGi based server solutions. Gyrex provides a platform on top of the Equinox OSGi framework to allow seamless and pain-free operation of Equinox server clusters. It also provides frameworks and concepts for developing, deploying and scaling applications on top of Gyrex based clouds.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/gyrex\/download\/","website":"http:\/\/www.eclipse.org\/gyrex\/","overview":"http:\/\/projects.eclipse.org\/projects\/rt.gyrex","offset":"3","new":false,"releases":[{"name":"1.3.0","description":"\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\tDistributed EventBus\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tSupport for WebSockets in JAX-RS application\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tSupport for Servlet 3.1 API\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tPerformance improvements\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tDependency updates\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.emft.emf-facet":{"id":"modeling.emft.emf-facet","name":"Eclipse EMF Facet","description":"\u003Cp\u003EEclipse EMF Facet is a solution to extend existing Ecore metamodels without having to modify them.\u003C\/p\u003E\r\n\u003Cp\u003EThe idea is to provide non-intrusive mechanisms to add new features (types, attributes, operations and references) to a metamodel and to customize the existing features by adding extra properties (icons, labels, etc.)\u003C\/p\u003E\r\n\u003Cp\u003EThese mechanisms are based on a query abstraction framework to be able to use all the kinds of queries independently of their implementation language (Java, OCL, ATL, JXPath, etc.)\u003C\/p\u003E\r\n\u003Cp\u003EA part of this tooling will be imported from the MoDisco project.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/facet\/downloads\/","website":"http:\/\/www.eclipse.org\/facet\/","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.emft.emf-facet","offset":"2","new":false,"releases":[{"name":"0.4.0","description":"\u003Cp\u003EThe \u003Cb\u003EEMF Facet 0.4.0\u003C\/b\u003E release is focused on maintenance and in particular to \u003Ca class=\u0022external text\u0022 href=\u0022https:\/\/bugs.eclipse.org\/bugs\/buglist.cgi?list_id=1799032;short_desc=%5BUnit%20Test%20Failure%5D;bug_severity=blocker;bug_severity=critical;bug_severity=major;bug_severity=normal;bug_severity=minor;bug_severity=trivial;bug_severity=enhancement;query_format=advanced;bug_status=UNCONFIRMED;bug_status=NEW;bug_status=ASSIGNED;bug_status=REOPENED;short_desc_type=allwordssubstr;product=EMFT.facet\u0022 rel=\u0022nofollow\u0022 title=\u0022https:\/\/bugs.eclipse.org\/bugs\/buglist.cgi?list_id=1799032;short_desc=%5BUnit%20Test%20Failure%5D;bug_severity=blocker;bug_severity=critical;bug_severity=major;bug_severity=normal;bug_severity=minor;bug_severity=trivial;bug_severity=enhancement;query_format=advanced;bug_status=UNCONFIRMED;bug_status=NEW;bug_status=ASSIGNED;bug_status=REOPENED;short_desc_type=allwordssubstr;product=EMFT.facet\u0022\u003Eunit test failures\u003C\/a\u003E fixing.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"tools.objectteams":{"id":"tools.objectteams","name":"Eclipse Object Teams","description":"\u003Cp\u003EThe Object Teams approach extends object oriented programming with new concepts for reconciling the tensions that otherwise exist between modularity, re-use, encapsulation and long term maintenance and evolution. This is achieved by supporting programming with multiple views, which can be composed in various scalable ways.\u003C\/p\u003E\r\n\u003Cp\u003EObject Teams introduces two new kinds of classes:\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\t\u003Cb\u003ERoles\u003C\/b\u003E support a per instance specialization of existing objects.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tA \u003Cb\u003ETeam\u003C\/b\u003E groups a set of interacting roles into one coherent encapsulated, nestable module.\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\u003Cp\u003EWhen binding a role class to its base, methods are declaratively wired for forwarding (role-to-base: \u0026quot;callout\u0026quot;) and interception (base-to-role: \u0026quot;callin\u0026quot;).\u003C\/p\u003E\r\n\u003Cp\u003EThe Object Teams project provides development support at these levels:\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\tThe programming language OT\/J extends Java\u0026trade;\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tThe Object Teams Development Tooling (OTDT) extends Eclipse\/JDT\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tOT\/Equinox extends Equinox\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tOT\/JPA extends EclipseLink\/JPA\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n","download":"http:\/\/www.eclipse.org\/objectteams\/download.php","website":"http:\/\/www.eclipse.org\/objectteams\/","overview":"http:\/\/projects.eclipse.org\/projects\/tools.objectteams","offset":"2","new":false,"releases":[{"name":"2.3.0","description":"\u003Cp\u003ELuna annual release (2.3) of Object Teams.\u003C\/p\u003E\r\n\u003Cp\u003EMain themes:\u003C\/p\u003E\r\n\u003Ch2\u003E\r\n\tOT\/J\u003C\/h2\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\tAdopt new features of Java\u0026trade; 8 into the language OT\/J\r\n\t\t\u003Cul\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tmerge grammars and address potential conflicts\u003C\/li\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tmerge compiler implementation\u003C\/li\u003E\r\n\t\t\u003C\/ul\u003E\r\n\t\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tEnable running OT\/J programs on a Java\u0026trade; 8 VM, by providing two alternative weavers\r\n\t\t\u003Cul\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tthe traditional BCEL-based weaver is a mature technology that handles all of Java 7 and OT\/J, but it cannot handle Java 8 class files.\u003C\/li\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\ta new ASM-based weaver will be first released with Luna, which can handle all elements of Java 8 byte code. Additionally, this weaver is capable of runtime weaving (as opposed to load-time weaving), However, this weaver needs more maturing before being enabled as the default\u003C\/li\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tto support both weavers, the compiler can produce class files in two alternative formats.\u003C\/li\u003E\r\n\t\t\u003C\/ul\u003E\r\n\t\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\u003Ch2\u003E\r\n\tOTDT\u003C\/h2\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\tProvide essential IDE support for the combination of Java 8 features with OT\/J\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\u003Ch2\u003E\r\n\tOT\/Equinox\u003C\/h2\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\tMigrate to the Luna version of Equinox\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tReduce dependence on Equinox-specific API in favor of standard OSGi API\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.emf.diffmerge":{"id":"modeling.emf.diffmerge","name":"Eclipse EMF Diff\/Merge","description":"\u003Cp\u003EEclipse EMF Diff\/Merge is a diff\/merge tool for models. Its main purpose is to help build higher-level tools that need to merge models based on consistency rules. GUI components are also provided. Typical usages include model refactoring, iterative model transformations, bridges between models or modeling tools, collaborative modeling environments, or versioning systems.\u003C\/p\u003E\r\n\u003Cp\u003ELink: \u003Ca href=\u0022http:\/\/wiki.eclipse.org\/EMF_DiffMerge\u0022\u003EEMF Diff\/Merge Wiki\u003C\/a\u003E\u003C\/p\u003E\r\n","download":"http:\/\/wiki.eclipse.org\/EMF_DiffMerge\/Download","website":"http:\/\/wiki.eclipse.org\/EMF_DiffMerge","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.emf.diffmerge","offset":"2","new":false,"releases":[{"name":"0.3.0","description":"\u003Cp\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-family: Arial, Helvetica, sans-serif; line-height: 18px;\u0022\u003EEMF Diff\/Merge is a diff\/merge tool for models. Its main purpose is to help build higher-level tools that need to merge models based on consistency rules. GUI components are also provided. Typical usages include model refactoring, iterative model transformations, bridges between models or modeling tools, collaborative modeling environments, or versioning systems.\u003C\/span\u003E\u003C\/p\u003E\r\n\u003Cp\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-family: Arial, Helvetica, sans-serif; line-height: 18px;\u0022\u003EThis is the Luna release\u0026nbsp;\u003C\/span\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-family: Arial, Helvetica, sans-serif; line-height: 18px;\u0022\u003Eof EMF Diff\/Merge\u003C\/span\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-family: Arial, Helvetica, sans-serif; line-height: 18px;\u0022\u003E. It provides better flexibility and customization facilities in order to cover a wider range of usages and integration scenarios.\u003C\/span\u003E\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.acceleo":{"id":"modeling.acceleo","name":"Eclipse Acceleo","description":"\u003Cp\u003EEclipse\u0026nbsp;\u003Ca href=\u0022http:\/\/www.eclipse.org\/acceleo\u0022\u003EAcceleo\u003C\/a\u003E is an open source code generator implementing the \u003Ca href=\u0022http:\/\/www.omg.org\/\u0022\u003EOMG\u003C\/a\u003E\u0026#39;s \u003Ca href=\u0022http:\/\/www.omg.org\/spec\/MOFM2T\/1.0\/\u0022\u003EMOF Model to Text Language (MTL)\u003C\/a\u003E standard that uses any \u003Ca href=\u0022http:\/\/eclipse.org\/modeling\/emf\/\u0022\u003EEMF\u003C\/a\u003E based models (UML, SysML, domain specific models...) to generate any kind of code (Java, C, PHP...).\u003C\/p\u003E\r\n\u003Cp\u003EYou do not need to be an expert to start using the plug-ins and create your first code generator : using the provided example projects and the powerful completion feature of the Acceleo editor, it is very easy to get started and understand the basic principles.\u003C\/p\u003E\r\n\u003Cp\u003EMore information is available on the wiki page for \u003Ca href=\u0022http:\/\/wiki.eclipse.org\/Acceleo\u0022\u003EAcceleo\u003C\/a\u003E.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/acceleo\/download","website":"http:\/\/www.eclipse.org\/acceleo","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.m2t.acceleo","offset":"2","new":false,"releases":[{"name":"3.5.0","description":"\u003Cp\u003EThe Acceleo 3.5.0 release will be focused on maintenance; with stability and performance enhancement as the main themes, along with further improvements in the documentation. This release plan will be updated accordingly if and when new features are needed by the community. With this new release, we will remove outdated components and switch to Java 6.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.emfcompare":{"id":"modeling.emfcompare","name":"Eclipse EMF Compare","description":"\u003Cp\u003E\u003Ca href=\u0022http:\/\/wiki.eclipse.org\/index.php\/EMF_Compare\u0022\u003EEclipse EMF Compare\u003C\/a\u003E brings model comparison to the EMF framework, this tool provides generic support for any kind of metamodel in order to compare and merge models. The objectives of this component are to provide a stable and efficient generic implementation of model comparison and to provide an extensible framework for specific needs.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/emf\/compare\/downloads\/","website":"http:\/\/www.eclipse.org\/emf\/compare\/","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.emfcompare","offset":"2","new":false,"releases":[{"name":"3.0.0","description":"\u003Cp\u003EThe main focus of EMF Compare 3.0 was a complete overhaul of the user experience, making comparisons faster while increasing robustness and turning the user interface into a more intuitive facade to the merging of differences.\u003C\/p\u003E\r\n\u003Cp\u003EThe release material and New \u0026amp; Noteworthy for this release can be found at https:\/\/wiki.eclipse.org\/EMF_Compare\/ReleaseReview\/Luna\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.emf.egf":{"id":"modeling.emf.egf","name":"Eclipse Generation Factories (EGF)","description":"\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n\u003Cp\u003EEGF (Eclipse Generation Factories) is a software factory tool with the purpose to generate software artifacts, such as code or application.\u003C\/p\u003E\r\n\u003Cp\u003ELinks:\u0026nbsp;\u003Ca href=\u0022http:\/\/wiki.eclipse.org\/EGF\u0022\u003EEGF Wiki\u003C\/a\u003E,\u0026nbsp;\u003Ca href=\u0022http:\/\/wiki.eclipse.org\/EGF_Installation\u0022\u003EDownload and installation of EGF\u003C\/a\u003E\u003C\/p\u003E\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n\u003Cp\u003EEGF is a software factory tool which enables to develop simple and complex generators. A workflow enables to orchestrate and execute different kind of tools (e.g., ATL for model-to-model transformations, Acceleo for model-to-text transformations) and code written in a language (e.g., Java, Ant, JRuby). EGF also includes a declarative formalism of pattern with the capability to develop customizable generations. The extensibility of EGF enables to support new tools or languages for orchestration, and to support new types of generation formalisms. All the generation elements are encapuslated in factory components. A coherent set of factory components defines a generation portfolio reusable and customizable in different project contexts. EGF is released with two demonstrative and operational generation portfolios. The first one enriches the EMF generation with new features: i) generation of new types of artefacts (e.g., JavaDoc, ecoretools diagrams), ii) customization of the EMF generation with patterns, iii) a generation DSL to easily configure an EMF generation. The second EGF portolfio is a DSL and generator for continuous integration in order to facilitate the definition of continuous integration chains and to target new integration continuous platforms while the continuous integration tools evolve.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/downloads\/download.php?file=\/egf\/tool\/egf_1.2.0\/org.eclipse.egf_1.2.0.v20140605-1143.zip","website":"http:\/\/www.eclipse.org\/egf","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.emf.egf","offset":"3","new":false,"releases":[{"name":"1.2.0","description":"\u003Cp\u003EEGF (Eclipse Generation Factories) is a software factory tool with the purpose to generate software artifacts, such as code or application. EGF provides two generation portfolios as examples: 1) an\u0026nbsp;\u003Ca href=\u0022http:\/\/wiki.eclipse.org\/EGF\/Portfolio\/EMF\u0022 title=\u0022EGF\/Portfolio\/EMF\u0022\u003EEnhancement of the EMF Generation\u003C\/a\u003E, 2) a \u0026nbsp;\u003Ca href=\u0022http:\/\/wiki.eclipse.org\/EGF\/Portfolio\/Build\u0022 title=\u0022EGF\/Portfolio\/Build\u0022\u003EBuild EGF Portofolio\u003C\/a\u003E\u0026nbsp;wich is\u0026nbsp;a build editor and generator for Hudson\/Jenkins and Buckminster as target. Additional language taks (i.e., Acceleo 2, Jython, JRuby) can be downloaded from\u0026nbsp;\u003Ca href=\u0022http:\/\/code.google.com\/a\/eclipselabs.org\/p\/egf-portfolio\/\u0022\u003EEGF EclipseLabs\u003C\/a\u003E.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"webtools":{"id":"webtools","name":"Eclipse Web Tools Platform Project","description":"\u003Cp\u003EThe Eclipse Web Tools Platform (WTP) project extends the Eclipse platform with tools for developing Web and Java EE applications. It includes source and graphical editors for a variety of languages, wizards and built-in applications to simplify development, and tools and APIs to support deploying, running, and testing apps.\u003C\/p\u003E\r\n","download":"http:\/\/download.eclipse.org\/webtools\/downloads\/","website":"http:\/\/www.eclipse.org\/webtools\/","overview":"http:\/\/projects.eclipse.org\/projects\/webtools","offset":"2","new":false,"releases":[{"name":"3.6.0","description":"\u003Cp\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-family: Arial, Helvetica, sans-serif; line-height: 18px;\u0022\u003EThe Web Tool Platform (WTP) project provides extensible frameworks and exemplary tools to build Web and Java EE applications. This document describes the features and the API set for the Luna release.\u003C\/span\u003E\u003C\/p\u003E\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n\u003Cp\u003E\u003Ca href=\u0022http:\/\/www.eclipse.org\/projects\/project-plan.php?planurl=http:\/\/www.eclipse.org\/webtools\/standard-project-plans\/luna\/wtp-plan.xml\u0022\u003EFull Luna Project Plan\u003C\/a\u003E\u003C\/p\u003E\r\n","subprojects":["webtools.common","webtools.dali","webtools.ejbtools","webtools.java-ee-config","webtools.jeetools","webtools.jsdt","webtools.jsf","webtools.libra","webtools.releng","webtools.servertools","webtools.sourceediting","webtools.webservices"],"date":1403668800}]},"technology.jubula":{"id":"technology.jubula","name":"Eclipse Jubula Functional Testing Tool","description":"\u003Cp\u003EEclipse Jubula provides functional GUI testing support for Java and HTML applications. It further provides an anchor point for a broader testing scope including requirements analysis, code coverage of Java applications and test metrics.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/jubula\/download.php","website":"http:\/\/www.eclipse.org\/jubula\/","overview":"http:\/\/projects.eclipse.org\/projects\/technology.jubula","offset":"3","new":false,"releases":[{"name":"2.3.0 (Luna)","description":"\u003Cp\u003EJubula provides automated functional GUI testing for Java and HTML applications. It is aimed at teams who want their automated tests to be written by test experts from the user perspective, without requiring any coding effort. Jubula tests incorporate best practices from software development to ensure long-term maintainablity of the automated tests.\u003C\/p\u003E\r\n\u003Cp\u003ETechnical details\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\tSupports Swing, SWT\/RCP(3.x and e4 based)\/GEF, HTML and JavaFX (with Java 8) applications\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tPlatform independent testing on Windows, Linux\/Unix and Mac\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tClient-server architecture for distributed testing\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tHeuristic object recognition\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tCommand line client for continuous integration\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tTesting of multiple applications supported\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tContext-sensitive help in client\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tProjects stored in multi-user database\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tPortability and version control via exports in XML format\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tClose integration to ALM systems leveraging Mylyn connectors\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n","subprojects":[],"date":1403668800}]},"technology.jgit":{"id":"technology.jgit","name":"Eclipse JGit: Java implementation of Git","description":"\u003Cp\u003EEclipse JGit is a pure Java implementation of the \u003Ca href=\u0022http:\/\/git-scm.com\/\u0022\u003EGit\u003C\/a\u003E version control system. Git is a distributed SCM, which means every developer has a full copy of all history of every revision of the code, making queries against the history very fast and versatile.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/jgit\/download\/","website":"http:\/\/www.eclipse.org\/jgit\/","overview":"http:\/\/projects.eclipse.org\/projects\/technology.jgit","offset":"3","new":false,"releases":[{"name":"3.4.0","description":null,"subprojects":[],"date":1403064000}]},"technology.egit":{"id":"technology.egit","name":"Eclipse EGit: Git Integration for Eclipse","description":"\u003Cp\u003EEclipse EGit is the Git integration for Eclipse. \u003Ca href=\u0022https:\/\/git-scm.com\/\u0022\u003EGit\u003C\/a\u003E is a distributed SCM, which means every developer has a full copy of all history of every revision of the code, making queries against the history very fast and versatile. The EGit project is implementing Eclipse tooling for the \u003Ca href=\u0022\/projects\/technology.jgit\/\u0022\u003EJGit\u003C\/a\u003E Java implementation of Git.\u003C\/p\u003E\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n","download":"http:\/\/eclipse.org\/egit\/download","website":"http:\/\/www.eclipse.org\/egit\/","overview":"http:\/\/projects.eclipse.org\/projects\/technology.egit","offset":"3","new":false,"releases":[{"name":"3.4.0","description":null,"subprojects":[],"date":1403064000}]},"modeling.emf.emf":{"id":"modeling.emf.emf","name":"Eclipse EMF","description":"\u003Cp\u003EEclipse EMF is a modeling framework and code generation facility for building tools and other applications based on a structured data model. From a model specification described in XMI, EMF provides tools and runtime support to produce a set of Java classes for the model, a set of adapter classes that enable viewing and command-based editing of the model, and a basic editor. Models can be specified using annotated Java, XML documents, or modeling tools like Rational Rose, then imported into EMF. Most important of all, EMF provides the foundation for interoperability with other EMF-based tools and applications. For more detailed information see the \u003Ca href=\u0022http:\/\/www.eclipse.org\/modeling\/emf\/docs\/#overviews\u0022\u003EEMF Overviews\u003C\/a\u003E and \u003Ca href=\u0022http:\/\/www.eclipse.org\/modeling\/emf\/docs\/#plandocs\u0022\u003EProject Plan\u003C\/a\u003E.\u003C\/p\u003E\r\n","download":null,"website":null,"overview":"http:\/\/projects.eclipse.org\/projects\/modeling.emf.emf","offset":"1","new":false,"releases":[{"name":"2.10.0","description":"\u003Cp\u003EThe EMF 2.10 release is primarily focused on bug fixes and flexibility\/performance improvements, except for the Xcore, which has functional enhancements.\u003C\/p\u003E\r\n","subprojects":[],"date":1400644800}]},"modeling.mdt.xsd":{"id":"modeling.mdt.xsd","name":"Eclipse MDT XSD (XML Schema Definition)","description":"\u003Cp\u003EXSD is a library that provides an API for manipulating the components of an XML Schema as described by the W3C XML Schema specifications, as well as an API for manipulating the DOM-accessible representation of XML.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/modeling\/mdt\/downloads\/?project=xsd","website":"http:\/\/www.eclipse.org\/modeling\/mdt\/?project=xsd","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.mdt.xsd","offset":"1","new":false,"releases":[{"name":"2.10.0","description":"\u003Cp\u003EXSD is has no significant development work.\u003C\/p\u003E\r\n","subprojects":[],"date":1400644800}]},"mylyn.docs.intent":{"id":"mylyn.docs.intent","name":"Intent","description":"\u003Cbr \/\u003E\r\n\u003Ch3\u003E\r\n\tIntent : tooling for writing useful and synchronized documentation\u003C\/h3\u003E\r\n\u003Cp\u003E\u003Ca href=\u0022http:\/\/wiki.eclipse.org\/Intent\u0022\u003EIntent\u003C\/a\u003E is a tool allowing developers to easily write a documentation up-to-date with any development artifact (models, code, environment...).\u003Cbr \/\u003E\r\n\t\u003Cbr \/\u003E\r\n\tThe documentation, integrated with other Eclipse tools, then becomes truly useful and is no longer a burden that developer have to carry to please their customers or their project manager.\u003Cbr \/\u003E\r\n\t\u003Cbr \/\u003E\r\n\tBased on Donald Knuth\u0026#39;s \u003Ca href=\u0022http:\/\/www-cs-faculty.stanford.edu\/~uno\/lp.html\u0022\u003ELiterate Programming\u003C\/a\u003E concepts and allowing collaborative work around design tasks, Intent will try to reconcile developers with Documentation.\u003C\/p\u003E\r\n\u003Cp\u003EIntent will be released under the \u003Ca href=\u0022http:\/\/wiki.eclipse.org\/Mylyn\u0022\u003E Mylyn \u003C\/a\u003E top-level project, and is planned to be fully integrated with Mylyn tools.\u003Cbr \/\u003E\r\n\t\u003Cbr \/\u003E\r\n\tThis project was just provisioned. You can see the proposal \u003Ca href=\u0022\/proposals\/mylyn.docs.intent\u0022\u003Ehere\u003C\/a\u003E, and get additional informations on the \u003Ca href=\u0022http:\/\/wiki.eclipse.org\/Intent\u0022\u003E Intent\u0026#39;s Wiki\u003C\/a\u003E.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/intent\/downloads\/","website":"http:\/\/www.eclipse.org\/intent","overview":"http:\/\/projects.eclipse.org\/projects\/mylyn.docs.intent","offset":"2","new":false,"releases":[{"name":"0.9.0","description":"\u003Cp style=\u0022margin: 0px 0px 3px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003EThe main concerns for the Mylyn Intent 0.9 release will be:\u003C\/p\u003E\r\n\u003Cp style=\u0022margin: 0px 0px 3px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003E- improvement\u0026nbsp;of the existing tooling (usability, performances, stability)\u003C\/p\u003E\r\n\u003Cp style=\u0022margin: 0px 0px 3px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003E- extensibility improvement(e.g. support additional parser to automatically create models according to documentation)\u003C\/p\u003E\r\n\u003Cp style=\u0022margin: 0px 0px 3px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003E- additional bridges (e.g. Manifest files, plugin.xml...) implementation to be able to documentation efficiently eclipse-based projects\u003C\/p\u003E\r\n\u003Cp style=\u0022margin: 0px 0px 3px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003E\u0026nbsp;\u003C\/p\u003E\r\n\u003Cp style=\u0022margin: 0px 0px 3px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003E\u003Cstrong\u003EIf you have a feature idea or a bug you want to see fixed please file a bugzilla and we will try to integrate them to the roadmap.\u003C\/strong\u003E\u003C\/p\u003E\r\n\u003Cp style=\u0022margin: 0px 0px 3px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003EThis release plan will be updated accordingly according to your feedbakc and when the themes are better outlined.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.graphiti":{"id":"modeling.graphiti","name":"Eclipse Graphiti","description":"\u003Cp\u003EThe goal of Eclipse Graphiti is to support the fast and easy creation of graphical tools, which can display and edit underlying domain models using a tool-defined graphical notation. Graphiti supports the developer in getting to a first version of an editor with very low effort by:\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\tHiding platform specific technology (e.g. GEF \/ Draw2D on Eclipse)\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tProviding rich default implementations inside the framework\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tProviding a default look and feel that was designed in close co-operation with usability specialists\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n","download":"http:\/\/www.eclipse.org\/graphiti\/download.php","website":"http:\/\/www.eclipse.org\/graphiti\/","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.gmp.graphiti","offset":"3","new":false,"releases":[{"name":"0.11.0","description":"\u003Cdiv class=\u0022fieldset-wrapper\u0022\u003E\r\n\t\u003Cdiv class=\u0022field field-name-body field-type-text-with-summary field-label-hidden\u0022\u003E\r\n\t\t\u003Cdiv class=\u0022field-items\u0022\u003E\r\n\t\t\t\u003Cdiv class=\u0022field-item even\u0022\u003E\r\n\t\t\t\t\u003Cp\u003EThe main topics for 0.11.0 release of Graphiti were to continue working to enable Graphiti to eventually leave incubation and implementing round offs to make the framework more flexible and easy to use. however, Graphiti will stay in the incubation mode.\u003C\/p\u003E\r\n\t\t\t\t\u003Cp\u003EGraphiti is part of the Luna Eclipse release train since M2. Luna will contain the Graphiti framework, examples, tools and\u0026nbsp; tests. Graphiti has joined the release train within the Indigo M4 milestone.\u003C\/p\u003E\r\n\t\t\t\t\u003Cp\u003EFor the full list of changes and implementation details see the \u003Ca href=\u0022http:\/\/www.eclipse.org\/graphiti\/pages\/whats-new.html\u0022\u003EGraphiti New \u0026amp; Noteworthy page for 0.11.0\u003C\/a\u003E.\u003C\/p\u003E\r\n\t\t\t\u003C\/div\u003E\r\n\t\t\u003C\/div\u003E\r\n\t\u003C\/div\u003E\r\n\u003C\/div\u003E\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"tools.mat":{"id":"tools.mat","name":"Eclipse Memory Analyzer","description":"\u003Cp\u003EThe Memory Analyzer provides a general purpose toolkit to analyze Java heap dumps. Besides heap walking and fast calculation of retained sizes, the Eclipse tool reports leak suspects and memory consumption anti-patterns. The main area of application are Out Of Memory Errors and high memory consumption.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/mat\/downloads.php","website":"http:\/\/www.eclipse.org\/mat","overview":"http:\/\/projects.eclipse.org\/projects\/tools.mat","offset":"3","new":false,"releases":[{"name":"1.4.0","description":"\u003Cp\u003EThe 1.4.0\u0026nbsp;release contains bugfixes and small improvements:\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli class=\u0022p\u0022\u003E\r\n\t\tUpdated some of the queries to be able to inspect collections and strings in heap dumps from Java 8\u003C\/li\u003E\r\n\t\u003Cli class=\u0022p\u0022\u003E\r\n\t\tThe Leak Hunter report now has links to the queries used to create the report\u003C\/li\u003E\r\n\t\u003Cli class=\u0022p\u0022\u003E\r\n\t\tOQL improvements (allow ranges when indexing arrays)\u003C\/li\u003E\r\n\t\u003Cli class=\u0022p\u0022\u003E\r\n\t\tImproved undo for Notes View and OQL Pane\u003C\/li\u003E\r\n\t\u003Cli class=\u0022p\u0022\u003E\r\n\t\tFixed issues with opening huge dumps\u003Cbr \/\u003E\r\n\t\t\u003Cbr \/\u003E\r\n\t\t\u0026nbsp;\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.mdt.ocl":{"id":"modeling.mdt.ocl","name":"Eclipse OCL (Object Constraint Language)","description":"\u003Cp\u003EEclipse OCL is an implementation of the \u003Ca href=\u0022http:\/\/www.omg.org\/spec\/OCL\u0022\u003EObject Constraint Language (OCL)\u003C\/a\u003E OMG standard for EMF-based models.\u003C\/p\u003E\r\n\u003Ch3\u003E\r\n\tClassic OCL Ecore\/UML\u003C\/h3\u003E\r\n\u003Cp\u003EThe Classic core OCL component provides the following capabilities to support OCL integration:\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\tDefines APIs for parsing and evaluating OCL constraints and queries on Ecore or UML models.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tDefines Ecore and UML implementations of the OCL abstract syntax model, including support for serialization of parsed OCL expressions.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tProvides a Visitor API for analyzing\/transforming the AST model of OCL expressions.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tProvides an extensibility API for clients to customize the parsing and evaluation environments used by the parser.\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\u003Cp\u003EThe accompanying examples provide:\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\tA Console for interactive evaluation of OCL expression on models.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\t(Indigo) An Impact Analyzer to support analysis and optimised re-evaluation.\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\u003Cp\u003EThe core OCL parser is generated by the LALR Parser Generator, a SourceForge project, licensed under the EPL v1.0. Download it from the LPG home page. This site includes the generator executable required to regenerate the parser code.\u003C\/p\u003E\r\n\u003Ch3\u003E\r\n\tUnified Pivot OCL\u003C\/h3\u003E\r\n\u003Cp\u003EThe Pivot OCL prototypes resolution of many oroblems in the OMG 2.4 specification.\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\tAn Xtext editor for OCL expressions (used by Papyrus and the Console).\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tAn Xtext editor for OCL documents complemementing meta-models (Complete OCL).\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tAn Xtext editor for OCLinEcore - OCL embedded in Ecore.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tAn Xtext editor for the OCL \u0026#39;Standard\u0026#39; Library model.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tA UML-aligned Unified or Pivot OCL meta-model supporting templates and reflection.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tAn OCL evaluator exploiting the extensible OCL library model.\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\u003Cp\u003EThe accompanying examples provide:\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\tAn Xtext Console for interactive evaluation of OCL expression on models.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tExtensible direct OCL to Java code generation\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tA Validity View for detailed Constraint\/ModelElement validity visualization\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tExtensible OCL debugger\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n","download":"http:\/\/www.eclipse.org\/modeling\/mdt\/downloads\/?project=ocl","website":null,"overview":"http:\/\/projects.eclipse.org\/projects\/modeling.mdt.ocl","offset":"1","new":false,"releases":[{"name":"5.0.0","description":"\u003Cp\u003EThe new Validity View provides a fine-grained visualization of the validity of each constraint\/model-element pair and a launch pad for the new OCL debugger.\u003C\/p\u003E\r\n\u003Cp\u003EThe OCL embedded in UML profiles may be used to validate UML models, and the OCL in UML models may be used to validate UML instances.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.sphinx":{"id":"modeling.sphinx","name":"Eclipse Sphinx","description":"\u003Cp\u003EEclipse phinx provide a modeling tool platform for Eclipse that eases the development of IDE-like tool support for modeling languages used in software and systems development.\u003C\/p\u003E\r\n\u003C!--break--\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\t\u003Cb\u003EWorkspace Management\u003C\/b\u003E: This component is built on EMF, EMF Transaction, and Eclipse Platform. It provides services for managing the lifecycle and editing domains of model instances that need to be centrally provided and shared in the workspace of Sphinx-based modeling tool applications. Included features are:\r\n\t\t\u003Cul\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tMapping of workspace resources to editing domains;\u003C\/li\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tThread-safe loading, reloading, and unloading of shared model instances;\u003C\/li\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tManagement of dirty state and thread-safe saving of shared model instances;\u003C\/li\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tAutomatic synchronization of shared model instances with changes on workspace resources.\u003C\/li\u003E\r\n\t\t\u003C\/ul\u003E\r\n\t\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\t\u003Cb\u003ENavigator View and Editor Sockets\u003C\/b\u003E: This component is built on EMF, EMF Transaction, Eclipse Common Navigator Framework, Eclipse UI Forms, and GMF (later on also Graphiti, see \u003Ci\u003EFuture components\u003C\/i\u003E). It provides common logic for creating explorer views, form editors, and graphical editors operating on shared model instances in Sphinx-based modeling tool applications. Included features are:\r\n\t\t\u003Cul\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tThread-safe operation on shared model instances in the workspace rather than on individually loaded resources;\u003C\/li\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tDirty state indication (asterisk on view\/editor tab) and save button enablement according to dirty state of underlying shared model instance;\u003C\/li\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tView\/editor-relative undo\/redo context management for operations on model elements and workspace resources;\u003C\/li\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tModel-oriented editor behavior, i.e., rather than always having to open a complete resource containing model elements in an editor, editors can be opened on individual model elements coming from the same or different resource;\u003C\/li\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\t\u0026quot;Link with Editor\u0026quot; capability, \u0026quot;Show In\u0026quot; capability, drag \u0026amp; drop, and view state saving and restoration for model elements in explorer views;\u003C\/li\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tAdvanced filter capabilities for model elements, Properties view content , and palettes in graphical editors;\u003C\/li\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tAdvanced graphical editor support (multi-editor and multi-diagram support, palette customization, preferences);\u003C\/li\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tSupport for creating links between model elements from different modeling languages.\u003C\/li\u003E\r\n\t\t\u003C\/ul\u003E\r\n\t\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\t\u003Cb\u003EValidation Runtime Extensions\u003C\/b\u003E: This component is built on EMF, EMF Transaction, EMF Validation, and Eclipse Platform. It provides extended runtime-level services for validating models or model fragments in Sphinx-based modeling tool applications and visualizing validation results. Included features are:\r\n\t\t\u003Cul\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tManual (on-demand) and automatic (on-the-fly) validation;\u003C\/li\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tValidation problem marker management;\u003C\/li\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tModel-oriented Validation view (alias Problems view);\u003C\/li\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tValidation label decorator for model explorer view.\u003C\/li\u003E\r\n\t\t\u003C\/ul\u003E\r\n\t\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\t\u003Cb\u003ECompare \u0026amp; Merge Integration\u003C\/b\u003E: This component is built on EMF, EMF Transaction, EMF Compare, and Eclipse Compare Support. It provides extensions enabling model-based compare\/merge operations to be carried out on shared model instances in Sphinx-based modeling tool applications. Included features are:\r\n\t\t\u003Cul\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tThread-safe operation on shared model instances in the workspace rather than on individually loaded resources;\u003C\/li\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tThread-safe automatic merge operations;\u003C\/li\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tComparison\/merge of individual model elements or fragments (instead of complete resources only);\u003C\/li\u003E\r\n\t\t\t\u003Cli\u003E\r\n\t\t\t\tModel-oriented dirty state management and editor-relative undo\/redo contexts.\u003C\/li\u003E\r\n\t\t\u003C\/ul\u003E\r\n\t\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\t\u003Cb\u003EEMF Runtime \u0026amp; Eclipse Platform Extensions\u003C\/b\u003E: This component is built on EMF, EMF Transaction, and Eclipse Platform. It provides common runtime-level enhancements such as description of meta-models, description of shared model instances including their scopes, meta-model compatibility services, as well as a couple of performance optimizations and utilities. They are used by all other Sphinx platform components and are also available to Sphinx-based modeling tool applications.\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n","download":"http:\/\/www.eclipse.org\/sphinx\/download.php","website":"http:\/\/www.eclipse.org\/sphinx\/","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.mdt.sphinx","offset":"3","new":false,"releases":[{"name":"0.8.0","description":"\u003Cp\u003EThe Sphinx 0.8.0 release is focused on some functional enhancements as well as on\u0026nbsp;bug fixes and flexibility\/performance improvements. The most prominent functional enhancements include:\u003C\/p\u003E\r\n\u003Ch4\u003E\r\n\tXML persistence mapping based XML serializer and XSD generator for EMF models\u003C\/h4\u003E\r\n\u003Cp\u003EThis is a new component in Sphinx that enables metamodel designers to customize the structure of the XML documents used to persist EMF model instances in a highly flexible way and generate a corresponding XSD schema. The basis for this customization are dedicated XML persistence mapping annotations which can be added to the classes and features of the underlying Ecore metamodel. The annotated Ecore metamodel is used for two things: At runtime, it drives the serialization\/deserialization of EMF model instances into\/from XML documents with the intended custom structure, and at design time, it controls the generation of the XSD schema that describes the custom XML structure formally and can be used to validate the XML documents containing the serialized EMF model instances.\u003C\/p\u003E\r\n\u003Cp\u003EFrom a principle point of view this goes into the same direction as what can be done with the ExtendedMetaData annotations supported by the EMF Core framework. However, the extent to which XML document structures can be customized using ExtendedMetaData annotations is somewhat limited. Compared to that, XML persistence mapping annotations allow for much more flexibility and expressiveness and enable EMF Ecore metamodels to be mapped to XML document structures that are as complex as those defined by AUTOSAR [1] or EAST-ADL [2].\u003C\/p\u003E\r\n\u003Cp\u003E[1]\u0026nbsp;http:\/\/www.autosar.org\u003C\/p\u003E\r\n\u003Cp\u003E[2]\u0026nbsp;http:\/\/www.east-adl.info\u003C\/p\u003E\r\n\u003Ch4\u003E\r\n\tCross-metamodel referencing support\u003C\/h4\u003E\r\n\u003Cp\u003ESphinx has the intrinsic policy that the model files for every metamodel get loaded into their own editing domain\/resource set (which may or may not be customized in a way that is specific to the metamodel in question). This has been working out fine as long as cross-document references existed only between model files that are based on the same metamodel and end up in the same Sphinx-managed\u0026nbsp;editing domain\/resource set. However, some Sphinx adopters have come up with use cases where it has been necessary to provide support for cross-document references between model files of different metamodels. Given that Sphinx loads the model files into different editing domains\/resource sets in this case, there was no out-of-the-box way to resolve such cross-metamodel cross-document references.\u003C\/p\u003E\r\n\u003Cp\u003ETo support such scenarios without breaking the way how Sphinx organizes the mapping of model files to editing domains\/resource sets, Sphinx has been enhanced to support the resolution of cross-document references across different resource sets. This comes down to that cross-document references between to model elements from the \u003Cstrong\u003Esame \u003C\/strong\u003Emetamodel are resolved as usually, i.e., within the resource set of the model element at the \u003Cstrong\u003Esource\u003C\/strong\u003E end of the cross-document reference. But when it happens that the model element being referenced is based on a \u003Cstrong\u003Edifferent \u003C\/strong\u003Emetamodel than the model element by which it is referenced, the resolution of the cross-document reference gets transparently delegated to the resource set behind the model element at the \u003Cstrong\u003Etarget \u003C\/strong\u003Eend of the cross-document reference.\u003C\/p\u003E\r\n\u003Ch4\u003E\r\n\tImproved integration of UML2\u003C\/h4\u003E\r\n\u003Cp\u003EIn order to improve the usefulness of Sphinx for handling UML2 models, a couple of improvements have been implemented.\u003C\/p\u003E\r\n\u003Cp\u003EThese include the deprecation of some Sphinx APIs which were based on the obviously invalid assumption the a model resource always contains only a single root element. When using them with multi-rooted model files (which happens quite frequently when working with UML2 files), this limitation entailed that only the first root element became available in Sphinx and were accessible through the Sphinx UI (Model Explorer, form editors, etc.) whereas all subsequent root elements were ignored. Therefore, all Sphinx APIs contributing to this limitation were replace by new APIs supporting single- and multi-rooted model files (e.g., EcorePlatformUtil#loadModelRoot(IFile, Map) : EObject was replace by\u0026nbsp;EcorePlatformUtil#loadResource(IFile, Map) : Resource).\u003C\/p\u003E\r\n\u003Cp\u003EAnother enhancement has been made to ensure that UML2 models can take advantage of Sphinx\u0026#39;\u0026nbsp;\u003Cspan style=\u0022color: rgb(0, 0, 0); font-size: small; white-space: pre-wrap;\u0022\u003Eadvanced resource scoping capabilities enabling different instances of the same metamodel to be managed and distinguished within the Eclipse workspace. Most importantly, this guarantees that cross-document references between different model files get only resolved within the set of resources that belong to the same model instance but not within all resources that are present in the workspace. \u003C\/span\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-size: small; white-space: pre-wrap;\u0022\u003EHowever, this feature implied that the underlying metamodel implementation extends Sphinx\u0026#39; ExtendedEObjectImpl or ExtendedMinimalEObjectImpl instead of EMF\u0026#39;s EObjectImpl or MinimalEObjectImpl as EObject root class. While this may be acceptable for a metamodel that one develops on one\u0026#39;s on behalf, it becomes impossible to do so for metamodels that already exsist and have been created by a third party, such as UML2. To overcome this issue, the proxy resolution capabilities in Sphinx\u0026#39; ExtendedResourceSetImpl have been significantly enhanced. As a result, it is now possible to benefit of full resource scoping support with metamodels that are purely based on EMF and don\u0026#39;t extend any Sphinx classes. But as often in live, this extra flexibility does not come totally for free. The price to pay consists in longer proxy URIs for unresolved model element references because Sphinx need\u0026#39;s to store some context information that is vital to the resource scoping capability in the query strings of the proxy URIs. When working with models that have many unresolvable references this can lead to a significantly increased memory consumption. For this reason, the existing approach to leveraging the Sphinx resource scoping capability has been left in place. So, metamodels that don\u0026#39;t \u0026quot;mind\u0026quot; extending \u003C\/span\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-size: small; white-space: pre-wrap;\u0022\u003EExtendedEObjectImpl or ExtendedMinimalEObjectImpl and pulling in a dependency on Sphinx can continue to do so and enjoy full resource scoping support without entailing that the longer context-aware proxy URIs need to be used and possibly provoke an increased memory consumption.\u003C\/span\u003E\u003C\/p\u003E\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"datatools":{"id":"datatools","name":"Eclipse Data Tools Platform","description":"\u003Cp\u003EThe Eclipse Data Tools Platform provides extensible frameworks and exemplary tools, enabling a diverse set of plug-in offerings specific to particular data-centric technologies and supported by the DTP ecosystem.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/datatools\/downloads.php","website":"http:\/\/www.eclipse.org\/datatools\/","overview":"http:\/\/projects.eclipse.org\/projects\/datatools","offset":"1","new":false,"releases":[{"name":"1.12.0","description":"\u003Cp\u003EDTP is a mature project with (currently) a low level of development activity.\u0026nbsp; The 1.12 release is primarily a bug-fix release.\u003C\/p\u003E\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n","subprojects":["datatools.connectivity","datatools.enablement","datatools.modelbase","datatools.sqltools"],"date":1403668800}]},"technology.actf":{"id":"technology.actf","name":"Eclipse Accessibility Tools Framework","description":"\u003Cp\u003EThe Accessibility Tools Framework (ACTF) is a subproject of the Eclipse Technology Project.\u003C\/p\u003E\r\n\u003Cp\u003EThe ACTF is a software framework which serves as an extensible infrastructure upon which developers can build a variety of utilities that help to evaluate and enhance the accessibility of applications and content for people with disabilities. A collection of example utilities will also be provided which were created on top of the framework such as compliance validation tools, assistive technology simulation applications, usability visualization tools, unit-testing utilities, and alternative accessible interfaces for applications. The ACTF infrastructure and the utilities will be integrated into a single tooling environment on top of the Eclipse framework. The framework components will function cooperatively with each other and with other Eclipse projects to provide a comprehensive development environment for creating accessible applications and content.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/actf\/downloads\/index.php","website":"http:\/\/www.eclipse.org\/actf\/","overview":"http:\/\/projects.eclipse.org\/projects\/technology.actf","offset":"3","new":false,"releases":[{"name":"1.2.0","description":"\u003Cp\u003EThe Accessibility Tools Framework (ACTF) is a subproject of the Eclipse Technology Project.\u003Cbr \/\u003E\r\n\tACTF is a framework that serves as an extensible infrastructure upon which developers can build a variety of utilities that help to evaluate and enhance the accessibility of applications and content for people with disabilities. A collection of example utilities will also be provided which were created on top of the framework such as compliance validation tools, assistive technology simulation applications, usability visualization tools, unit-testing utilities, and alternative accessible interfaces for applications.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.mdt.papyrus":{"id":"modeling.mdt.papyrus","name":"Eclipse Papyrus","description":"\u003Cp\u003EEclipse Papyrus provides an integrated, user-consumable environment for editing any kind of \u003Ca href=\u0022\/projects\/modeling.emf\u0022\u003EEMF\u003C\/a\u003E model and particularly supporting UML and related modeling languages such as SysML and MARTE. Papyrus provides diagram editors for EMF-based modeling languages amongst them UML 2 and SysML and the glue required for integrating these editors (GMF-based or not) with other MBD and MDSD tools. It also offers a very advanced support of UML profiles that enables users to define editors for DSLs based on the UML 2 standard and its extension mechanisms. The main feature of Papyrus regarding this latter point is a set of very powerful customization mechanisms which can be leveraged to create user-defined Papyrus perspectives and give it the same look and feel as a native DSL editor.\u003C\/p\u003E\r\n\u003Cp\u003EFor more details on Papyrus, see the \u003Ca href=\u0022http:\/\/www.eclipse.org\/papyrus\u0022\u003Ehome page\u003C\/a\u003E or the \u003Ca href=\u0022http:\/\/wiki.eclipse.org\/MDT\/Papyrus\u0022\u003EWiki\u003C\/a\u003E.\u003C\/p\u003E\r\n","download":"https:\/\/www.eclipse.org\/papyrus\/downloads\/","website":"https:\/\/www.eclipse.org\/papyrus\/","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.mdt.papyrus","offset":"3","new":false,"releases":[{"name":"1.0.0","description":"\u003Cp\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-family: Arial, sans-serif; font-size: 12.222222328186035px; line-height: 16px;\u0022\u003EPapyrus is aiming at providing an integrated and user-consumable environment for editing any kind of EMF model and particularly supporting UML and related modeling languages such as SysML and MARTE. Papyrus provides diagram editors for EMF-based modeling languages amongst them UML 2 and SysML and the glue required for integrating these editors (GMF-based or not) with other MBD and MDSD tools.\u003C\/span\u003E\u003C\/p\u003E\r\n\u003Cp\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-family: Arial, sans-serif; font-size: 12.222222328186035px; line-height: 16px;\u0022\u003EPapyrus also offers a very advanced support of UML profiles that enables users to define editors for DSLs based on the UML 2 standard. The main feature of Papyrus regarding this latter point is a set of very powerful customization mechanisms which can be leveraged to create user-defined Papyrus perspectives and give it the same look and feel as a \u0026quot;pure\u0026quot; DSL editor.\u003C\/span\u003E\u003C\/p\u003E\r\n\u003Cp\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-family: Arial, sans-serif; font-size: 12.222222328186035px; line-height: 16px;\u0022\u003EThis release, version 1.0.0, marks\u0026nbsp;\u003C\/span\u003Ea highlight of the Papyrus story.\u0026nbsp;This release is indeed characterized not only by new features but also by major advances in performance, usability and robustness. It is fair to say that, with this release, the Papyrus project has reached true adulthood while its product has developed into a mature industrial-strength facility.\u003C\/p\u003E\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.mmt.atl":{"id":"modeling.mmt.atl","name":"Eclipse ATL","description":"\u003Cp\u003EATL (ATL Transformation Language) is a model transformation language and toolkit. In the field of Model-Driven Engineering (MDE), ATL provides ways to produce a set of target models from a set of source models. Developed on top of the Eclipse platform, the ATL Integrated Environnement (IDE) provides a number of standard development tools (syntax highlighting, debugger, etc.) that aims to ease development of ATL transformations.\u003C\/p\u003E\r\n","download":"http:\/\/eclipse.org\/mmt\/downloads\/?project=atl","website":"http:\/\/www.eclipse.org\/atl\/","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.mmt.atl","offset":"2","new":false,"releases":[{"name":"3.5.0","description":"\u003Cp\u003EThis release contains no particular enhancements. It fixes some minor issues and ensures compatibility with Eclipse Luna.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.mmt.qvt-oml":{"id":"modeling.mmt.qvt-oml","name":"Eclipse QVT Operational","description":"\u003Cp\u003EThe Eclipse QVT Operational component is an implementation of the Operational Mappings Language\u0026nbsp;defined by \u003Ca href=\u0022http:\/\/www.omg.org\/spec\/QVT\/\u0022\u003EMeta Object Facility\u0026trade; (MOF\u0026trade;) 2.0 Query\/View\/Transformation\u0026trade; (QVT\u0026trade;)\u003C\/a\u003E. In long term, it aims to provide a complete implementation of the operational part of the standard.\u003C\/p\u003E\r\n\u003Cp\u003EA high level overview of the QVT Operational language is available in form of presentations \u003Ca href=\u0022http:\/\/help.eclipse.org\/kepler\/topic\/org.eclipse.m2m.qvt.oml.doc\/references\/M2M-QVTO.pdf\u0022\u003EModel Transformation with Operational QVT\u003C\/a\u003E and \u003Ca href=\u0022https:\/\/wiki.eclipse.org\/images\/e\/ee\/QVTO_EclipseCon_2009_Presentation.pdf\u0022\u003EThe Art of Model Transformation with Operational QVT\u003C\/a\u003E.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/mmt\/downloads\/index.php?project=qvto\u0026showAll=0\u0026showMax=5","website":"http:\/\/www.eclipse.org\/mmt\/qvto","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.mmt.qvt-oml","offset":"2","new":false,"releases":[{"name":"3.4.0","description":"\u003Cdiv\u003E\r\n\tQVT Operational component is an implementation of the Operational Mappings Language defined by the OMG standard specification (MOF) 2.0 Query\/View\/Transformation.\u003C\/div\u003E\r\n\u003Cdiv\u003E\r\n\tThis release will spend efforts on implementing constructions up to now missing in QVT Operational component thus to provide a complete implementation of the operational part of the standard.\u003C\/div\u003E\r\n\u003Cdiv\u003E\r\n\tImprovements of \u0026nbsp;QVTo engine compilation and execution efficiency are also priority goals of this release.\u003C\/div\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.ecp":{"id":"modeling.ecp","name":"Eclipse EMF Client Platform","description":"\u003Cp\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E\u003Cspan style=\u0022font-family: Lato, sans-serif; font-size: 14px; line-height: 20px;\u0022\u003EThe Eclipse EMF Client Platform is a framework for building EMF-based client applications. The goal is to provide reusable, adaptable and extensible UI components to develop applications based on a given EMF model. All components can be used stand-alone and be embedded into your own application. To get started, ECP provides a demo application, which integrates all provided components. This demo application allows you to get started by only providing your EMF model.\u0026nbsp;\u003C\/span\u003E\u003C\/span\u003E\u003Cbr style=\u0022color: rgb(224, 224, 224); font-family: Lato, sans-serif; font-size: 14px; line-height: 20px;\u0022 \/\u003E\r\n\t\u003Cb style=\u0022font-family: Lato, sans-serif; font-size: 14px; line-height: 20px; color: rgb(255, 64, 54);\u0022\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003EEMF Client Platform includes EMF Forms, a component to develop formbased UIs, please see\u0026nbsp;\u003C\/span\u003E\u003Ca href=\u0022http:\/\/eclipse.org\/ecp\/emfforms\u0022 style=\u0022color: rgb(237, 123, 147); text-decoration: none;\u0022\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003Ehere\u003C\/span\u003E\u003C\/a\u003E\u003Cspan style=\u0022color:#000000;\u0022\u003E.\u003C\/span\u003E\u003C\/b\u003E\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/emfclient\/download.html","website":"http:\/\/www.eclipse.org\/emfclient\/","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.emft.emf-client","offset":"2","new":true,"releases":[{"name":"1.3.0","description":"\u003Cp\u003EThis release adds\u0026nbsp;\u003Ca href=\u0022http:\/\/eclipse.org\/ecp\u0022\u003EEMF Client Platform\u003C\/a\u003E\u0026nbsp;and\u0026nbsp;\u003Ca href=\u0022http:\/\/eclipse.org\/ecp\/emfforms\u0022\u003EEMFForms\u003C\/a\u003E\u0026nbsp;to the Eclipse release train (Luna).\u003C\/p\u003E\r\n\u003Cp\u003EEMF Client Platform supports the development of Applications based on EMF data models. EMF Forms in particular allows the efficient development of form-based UIs.\u003C\/p\u003E\r\n\u003Cp\u003EFor more information see\u003C\/p\u003E\r\n\u003Cp\u003Ehttp:\/\/eclipse.org\/ecp\u003C\/p\u003E\r\n\u003Cp\u003Ehttp:\/\/eclipse.org\/ecp\/emfforms\u003C\/p\u003E\r\n\u003Cp\u003EThe 1.3.0 release aims to:\u003C\/p\u003E\r\n\u003Cp\u003E- Provide better IDE support for EMF Forms\u003C\/p\u003E\r\n\u003Cp\u003E- Be fully compatible with Luna Modeling Edition\u003C\/p\u003E\r\n\u003Cp\u003E- Provide a fully working RAP demo application\u003C\/p\u003E\r\n\u003Cp\u003E- Clean-Up API\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"soa.jwt":{"id":"soa.jwt","name":"Eclipse JWT","description":"\u003Cp\u003EThe \u003Cstrong\u003EEclipse\u0026nbsp;\u003C\/strong\u003E\u003Cb\u003EJava Workflow Tooling (JWT)\u003C\/b\u003E project provides design time, development time and runtime workflow tools. Thanks to its extensible architecture, it also fosters \u003Cb\u003Einteroperability\u003C\/b\u003E between Business Process Management (\u003Cb\u003EBPM\u003C\/b\u003E) platforms and \u003Cb\u003Eintegration\u003C\/b\u003E in Information Systems thanks to Service Oriented Architecture (\u003Cb\u003ESOA\u003C\/b\u003E).\u003C\/p\u003E\r\n","download":"http:\/\/wiki.eclipse.org\/JWT_Downloads#Current_Releases","website":"http:\/\/www.eclipse.org\/jwt\/","overview":"http:\/\/projects.eclipse.org\/projects\/soa.jwt","offset":"3","new":false,"releases":[{"name":"1.4.0","description":"\u003Cp\u003EThe 1.4.0 release is a maintenance release providing\u0026nbsp; upgrade to Eclipse 4.4 (Luna) as well as bug patches.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"birt":{"id":"birt","name":"Eclipse Business Intelligence and Reporting Tools (BIRT)","description":"\u003Cp\u003EEclipse BIRT is an open source Eclipse-based reporting system that integrates with your Java\/Java EE application to produce compelling reports.\u003C\/p\u003E\r\n","download":"http:\/\/download.eclipse.org\/birt\/downloads\/","website":"http:\/\/www.eclipse.org\/birt\/","overview":"http:\/\/projects.eclipse.org\/projects\/birt","offset":"2","new":false,"releases":[{"name":"4.4.0","description":"\u003Cp\u003EThe BIRT Luna release is focused on improving quality and responding to issues reported by the community in Bugzilla.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.emfstore":{"id":"modeling.emfstore","name":"Eclipse EMFStore","description":"\u003Cp\u003EEclipse EMFStore is a model repository (server) for EMF featuring collaborative editing and versioning of models. Existing versioning systems such as SVN or GIT are focused on textual artifacts and do not work well for models. The EMFStore is a repository and version control system for the Eclipse Modeling Framework (EMF) designed specifically for models. Instead of versioning the textual serialization of a model, it allows semantic versioning of the model and as a result, supports merging and conflict detection more effectively. The EMFStore server can be applied for EMF Model instances and can be integrated in any kind of existing tool.\u003C\/p\u003E\r\n\u003Cp\u003EA detailed description is available \u003Ca href=\u0022http:\/\/eclipse.org\/emfstore\/\u0022\u003Ehere\u003C\/a\u003E.\u003C\/p\u003E\r\n","download":"http:\/\/eclipse.org\/emfstore\/download.html","website":"http:\/\/eclipse.org\/emfstore","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.emft.emf-store","offset":"2","new":true,"releases":[{"name":"1.3.0","description":"\u003Cp\u003EThis release adds \u003Ca href=\u0022http:\/\/eclipse.org\/emfstore\u0022\u003EEMFStore \u003C\/a\u003Eto the yearly Eclipse release train (Luna). EMFStore is a server solution for EMF model instances, see http:\/\/eclipse.org\/emfstore\u003C\/p\u003E\r\n\u003Cp\u003EFurthermore it is a stabilization and reliability release that contains many bug fixes with respect to ChangeTracking, UI, LDAP connectivity and AccessControl.\u003C\/p\u003E\r\n\u003Cp\u003EThis release also contains some API relevant XML-RPC enhancements that allow to replace the built-in XML-RPC Webserver as well as configuring compression on the client.\u003Cbr \/\u003E\r\n\t\u0026nbsp;\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"technology.subversive":{"id":"technology.subversive","name":"Eclipse Subversive SVN Team Provider","description":"\u003Cp\u003EThe \u0026nbsp;Eclipse Subversive project is focused on development of an Eclipse Platform plug-in which provides SVN support. From the project organization point of view it is close to Eclipse CVS project and follows its concepts and Eclipse best practices. Namely the project consists of Core and UI plugins and two SVN Client plugins: JavaSVN, which provides a pure Java implementation; and JavaHL, which provides a native implementation.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/subversive\/downloads.php","website":"http:\/\/www.eclipse.org\/subversive\/","overview":"http:\/\/projects.eclipse.org\/projects\/technology.subversive","offset":"2","new":false,"releases":[{"name":"2.0","description":"\u003Cp\u003ESubversive is an Eclipse Team Provider for Subversion (SVN). Subversive is Technology sub-project. Release 2.0 will be available as a part of\u0026nbsp;Luna simultaneous release. The goal of this release is to provide compatibility with SVN 1.8 and add features introduced in the latest SVN versions.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.mdt.modisco":{"id":"modeling.mdt.modisco","name":"Eclipse MoDisco","description":"\u003Cp\u003EEclipse MoDisco provides an extensible framework to elaborate on model-driven solutions supporting software reverse engineering and modernization use cases such as technical migration, software improvement, documentation generation, quality insurance, etc.\u003Cbr \/\u003E\r\n\t\u003Cbr \/\u003E\r\n\tLegacy systems embrace a large number of technologies, making the development of tools to cope with legacy systems evolution a tedious and time consuming task. As modernization projects face with both technologies combination and various modernization situations, model-driven approaches and tools offer the requisite abstraction level to build up mature and flexible modernization solutions.\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\tQuality Assurance: verifying whether an existing system meets the required qualities (detection of anti-patterns in existing code and computation of metrics.)\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tDocumentation: extraction of information from an existing system to help understanding one aspect of this system (structure, behaviour, persistence, data-flow, change impact , etc).\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tImprovement: transformation of an existing system to integrate better coding norms or design patterns.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tMigration: transformation of an existing system to change a component, the framework, the language, or its architecture\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\u003Cbr \/\u003E\r\n\u003Cp\u003E\u003Ca href=\u0022http:\/\/wiki.eclipse.org\/MoDisco#Description\u0022 target=\u0022_blank\u0022\u003Emore about MoDisco \u0026raquo;\u003C\/a\u003E\u003C\/p\u003E\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/MoDisco\/downloads\/","website":"http:\/\/www.eclipse.org\/MoDisco\/","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.mdt.modisco","offset":"3","new":false,"releases":[{"name":"0.12.0","description":"\u003Cp\u003E\u003Cspan\u003EEclipse MoDisco (version 0.12.0) provides an extensible model driven reverse engineering framework to elaborate on solutions supporting different scenarios such as software modernization, quality assurance, retro-documentation, architecture improvement, etc. It offers base generic components\u0026nbsp;(Model Browser, Discovery Manager, OMG metamodels, etc.) as well as the dedicated support (metamodels, model discoverers, transformations, etc.) for dealing with several different technologies such as Java, JEE, XML.\u003C\/span\u003E\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.amalgam":{"id":"modeling.amalgam","name":"Eclipse Amalgamation","description":"\u003Cp\u003EThe Eclipse Modeling Project (EMP) was formed as a top-level project at Eclipse in order to bring together a number of modeling-related projects. While the Modeling project has been a success in many respects, it remains somewhat a collection of individual projects with little or no focus on integration or ease-of-use. As stated in the EMP \u003Ca href=\u0022http:\/\/www.eclipse.org\/modeling\/modeling-charter.php\u0022\u003Echarter\u003C\/a\u003E, the \u0026quot;Eclipse Modeling Project will focus on the evolution and promotion of model-based development technologies within the Eclipse community. It will unite projects falling into this classification to bring holistic model-based development capabilities to Eclipse.\u0026quot; While the task of unification is underway, the task of promotion is hindered by difficult installation, lack of integration, and poor usability. The intention of the Modeling Amalgamation project proposal is to augment the current Modeling project with one focused solely on refining the \u0026quot;user experience\u0026quot; when using Modeling project technologies.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/downloads\/packages\/","website":"http:\/\/www.eclipse.org\/modeling\/amalgam","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.amalgam","offset":"3","new":false,"releases":[{"name":"1.5.0","description":"\u003Cp\u003EThis release will focus on bringing stability, performance and UI integration in the Eclipse Modeling Package.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"tools.gef":{"id":"tools.gef","name":"Eclipse Graphical Editing Framework (GEF)","description":"\u003Cp\u003EThe Eclipse \u003Ca href=\u0022http:\/\/www.eclipse.org\/gef\u0022\u003EGraphical Editing Framework (GEF)\u003C\/a\u003E provides Eclipse-integrated end-user tools in terms of a \u003Ca href=\u0022http:\/\/www.graphviz.org\u0022\u003EGraphviz\u003C\/a\u003E authoring (\u003Ca href=\u0022https:\/\/github.com\/eclipse\/gef\/wiki\/DOT-User-Guide\u0022\u003EDOT editor, DOT Graph view\u003C\/a\u003E) and a word cloud rendering environment (\u003Ca href=\u0022https:\/\/github.com\/eclipse\/gef\/wiki\/Cloudio-User-Guide\u0022\u003ETag Cloud view\u003C\/a\u003E), as well as framework components (\u003Ca href=\u0022https:\/\/github.com\/eclipse\/gef\/wiki\/Common\u0022\u003ECommon\u003C\/a\u003E, \u003Ca href=\u0022https:\/\/github.com\/eclipse\/gef\/wiki\/Geometry\u0022\u003EGeometry\u003C\/a\u003E, \u003Ca href=\u0022https:\/\/github.com\/eclipse\/gef\/wiki\/FX\u0022\u003EFX\u003C\/a\u003E, \u003Ca href=\u0022https:\/\/github.com\/eclipse\/gef\/wiki\/MVC\u0022\u003EMVC\u003C\/a\u003E, \u003Ca href=\u0022https:\/\/github.com\/eclipse\/gef\/wiki\/Graph\u0022\u003EGraph\u003C\/a\u003E, \u003Ca href=\u0022https:\/\/github.com\/eclipse\/gef\/wiki\/Layout\u0022\u003ELayout\u003C\/a\u003E, \u003Ca href=\u0022https:\/\/github.com\/eclipse\/gef\/wiki\/Zest\u0022\u003EZest\u003C\/a\u003E, \u003Ca href=\u0022https:\/\/github.com\/eclipse\/gef\/wiki\/DOT\u0022\u003EDOT\u003C\/a\u003E, and \u003Ca href=\u0022https:\/\/github.com\/eclipse\/gef\/wiki\/Cloudio\u0022\u003ECloudio\u003C\/a\u003E) to create rich graphical Java client applications, Eclipse-integrated or standalone.\u003C\/p\u003E\r\n\u003Cp\u003EFor detailed information about how to get started, consider the \u003Ca href=\u0022https:\/\/github.com\/eclipse\/gef\/#eclipse-graphical-editing-framework-gef\u0022\u003EGitHub README\u003C\/a\u003E.\u003C\/p\u003E\r\n\u003Cp\u003E\u003Cspan style=\u0022font-size: 10px;\u0022\u003EPlease note that the legacy components\u0026nbsp;\u003C\/span\u003E\u003Ca href=\u0022https:\/\/www.eclipse.org\/gef\/draw2d\/index.php\u0022 style=\u0022font-size: 10px;\u0022\u003EDraw2d 3.x\u003C\/a\u003E\u003Cspan style=\u0022font-size: 10px;\u0022\u003E,\u0026nbsp;\u003C\/span\u003E\u003Ca href=\u0022https:\/\/www.eclipse.org\/gef\/gef_mvc\/index.php\u0022 style=\u0022font-size: 10px;\u0022\u003EGEF (MVC) 3.x\u003C\/a\u003E\u003Cspan style=\u0022font-size: 10px;\u0022\u003E, and\u0026nbsp;\u003C\/span\u003E\u003Ca href=\u0022https:\/\/www.eclipse.org\/gef\/zest\/index.php\u0022 style=\u0022font-size: 10px;\u0022\u003EZest 1.x\u003C\/a\u003E\u003Cspan style=\u0022font-size: 10px;\u0022\u003E\u0026nbsp;have been put into \u0026#39;pure maintenance\u0026#39; mode. As they are still an integral part of the Eclipse ecosystem, we will continue to include them in the simultaneous release, but new revisions will only be created as patches are provided by the community.\u0026nbsp;\u003C\/span\u003E\u003Cspan style=\u0022font-size: 10px;\u0022\u003ETo indicate that the GEF4 code base is the new production code base, we have transferred it to the original \u0026#39;GEF\u0026#39; namespace at the beginning of the Oxygen release stream, so that all its features and bundles now provide the \u0026#39;org.eclipse.gef\u0026#39; instead of the \u0026#39;org.eclipse.gef4\u0026#39; namespace (increasing their versions from 1.0.0 to 5.0.0). While the namespaces of the legacy components (\u0026#39;org.eclipse.draw2d\u0026#39;, \u0026#39;org.eclipse.gef\u0026#39;, \u0026#39;org.eclipse.zest\u0026#39;)\u0026nbsp;\u003C\/span\u003E\u003Cspan style=\u0022font-size: 10px;\u0022\u003Ehave been preserved\u003C\/span\u003E\u003Cspan style=\u0022font-size: 10px;\u0022\u003E, they are now referred to as \u0026#39;GEF-Legacy\u0026#39;.\u003C\/span\u003E\u003C\/p\u003E\r\n\u003Cp\u003E\u003Cimg alt=\u0022GEF generations\u0022 src=\u0022https:\/\/www.eclipse.org\/gef\/images\/GEF_generations.jpeg\u0022 style=\u0022width: 600px; height: 241px;\u0022 \/\u003E\u003C\/p\u003E\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n","download":null,"website":"http:\/\/www.eclipse.org\/gef","overview":"http:\/\/projects.eclipse.org\/projects\/tools.gef","offset":"1","new":false,"releases":[{"name":"3.9.100 (Luna)","description":"\u003Cp\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-family: Arial, Helvetica, sans-serif; line-height: 18px; \u0022\u003EThis document lays out the feature and API set for the next release of the Graphical Editing Framework (GEF) project, designated release\u0026nbsp;\u003C\/span\u003E3.9.100\u003Cspan style=\u0022color: rgb(0, 0, 0); font-family: Arial, Helvetica, sans-serif; line-height: 18px; \u0022\u003E\u0026nbsp;The release will be comprised of the Draw2d and GEF(MVC)\u0026nbsp;\u003C\/span\u003E3.9.100\u0026nbsp;\u003Cspan style=\u0022color: rgb(0, 0, 0); font-family: Arial, Helvetica, sans-serif; line-height: 18px; \u0022\u003Eand Zest 1.5.100 components.\u003C\/span\u003E\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.sirius":{"id":"modeling.sirius","name":"Eclipse Sirius","description":"\u003Cp\u003EEclipse Sirius enables the specification of a modeling workbench in terms of \u003Cstrong\u003Egraphical\u003C\/strong\u003E, \u003Cstrong\u003Etable\u003C\/strong\u003E or \u003Cstrong\u003Etree\u003C\/strong\u003E editors with validation rules and actions using declarative descriptions.\u003C\/p\u003E\r\n\u003C!--break--\u003E\r\n\u003Cp\u003EAll shape characteristics and behaviors can be easily configured with a \u003Cstrong\u003Eminimum technical knowledge\u003C\/strong\u003E. This description is \u003Cstrong\u003Edynamically interpreted \u003C\/strong\u003Eto materialize the workbench within the Eclipse IDE.\u003Cstrong\u003E No code generation\u003C\/strong\u003E is involved, the specifier of the workbench can have instant feedback while adapting the description.\u003C\/p\u003E\r\n\u003Cp\u003EOnce completed, the modeling workbench can be deployed as a \u003Cstrong\u003Estandard Eclipse plugin\u003C\/strong\u003E.\u003C\/p\u003E\r\n\u003Cp\u003EThanks to this short feedback loop a workbench or its specialization can be created in a matter of hours.\u003C\/p\u003E\r\n\u003Cp\u003E\u003Ca href=\u0022https:\/\/lh4.googleusercontent.com\/-18UIHb--FDQ\/Uht2vfYQqwI\/AAAAAAAAMBw\/fmGZ83aQGsI\/s0\/sirius-pan.png\u0022\u003E\u003Cimg alt=\u0022Graphical and Table editors made with Sirius\u0022 src=\u0022https:\/\/lh3.googleusercontent.com\/-oWnvyr7hoFE\/Uht0vwRViZI\/AAAAAAAAMAo\/lj7a_evd_jw\/w600-h806-no\/sirius-pan-small.png\u0022 style=\u0022width: 600px; height: 806px;\u0022 \/\u003E\u003C\/a\u003E\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/sirius\/download.html","website":"http:\/\/www.eclipse.org\/sirius","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.sirius","offset":"3","new":true,"releases":[{"name":"1.0.0","description":"\u003Cp\u003ESirius allows architects to easily create their own graphical modeling workbenches for specific domains (industrial systems, software applications or the organization of major companies). Based on a viewpoint approach, it enables the specification of custom Eclipse editors (diagrams, tables and trees) to create, edit and visualize EMF models.\u003C\/p\u003E\r\n\u003Cp\u003E\u003Cstrong\u003ELeaving Incubation Status\u003C\/strong\u003E.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"mylyn.context.mft":{"id":"mylyn.context.mft","name":"Model Focusing Tools","description":"\u003Cp\u003EThe Model Focusing Tools project brings Mylyn\u0026#39;s task-focused interface to modeling tools:\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\tDiagram editors, such as for Ecore and UML models\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tModel Navigators\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tModel Outlines\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tEMF generated editors\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\u003Cp\u003EIt provides a focused mode for diagrams that shows only the elements related to the task-at-hand, dramatically reducing information overload when working on large models. In addition, the task-focused interface extensions provide Mylyn\u0026rsquo;s one-click multitasking facilities for working with models, ensuring that developers can instantly recover from interruptions, and share model-specific expertise.\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\t\u003Ca href=\u0022http:\/\/wiki.eclipse.org\/Mylyn\/Modeling_Bridge\u0022\u003EMore Information\u003C\/a\u003E\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\u003Cp\u003E\u003Ca border=\u00220\u0022 href=\u0022\/mft\/mft-nodes.png\u0022\u003E\u003Cimg align=\u0022center\u0022 src=\u0022\/mft\/mft-nodes.png\u0022 width=\u0022480\u0022 \/\u003E\u003C\/a\u003E\u003C\/p\u003E\r\n","download":null,"website":"http:\/\/eclipse.org\/mft\/","overview":"http:\/\/projects.eclipse.org\/projects\/mylyn.context.mft","offset":"3","new":false,"releases":[{"name":"0.9.3","description":"\u003Cp\u003EThis release will be a maintainance release.\u003C\/p\u003E\r\n","subprojects":[],"date":1403755200}]},"ecd.orion":{"id":"ecd.orion","name":"Eclipse Orion","description":"\u003Cp\u003E\u003Cb\u003E\u003Ca href=\u0022http:\/\/eclipse.org\/orion\/\u0022\u003EThe Eclipse Orion Project\u003C\/a\u003E\u003C\/b\u003E\u0026#39;s objective is to create a browser-based open tool integration platform which is entirely focused on developing for the web, in the web. Tools are written in JavaScript and run in the browser. Great care has been taken to provide a web experience for development, rather than to recreate the traditional desktop IDE experience in a browser tab.\u003C\/p\u003E\r\n","download":"http:\/\/download.eclipse.org\/orion\/","website":"http:\/\/www.eclipse.org\/orion","overview":"http:\/\/projects.eclipse.org\/projects\/ecd.orion","offset":"3","new":false,"releases":[{"name":"6.0.0","description":null,"subprojects":[],"date":1403668800}]},"rt.ecf":{"id":"rt.ecf","name":"Eclipse Communication Framework","description":"\u003Cp\u003E\u003Ca href=\u0022http:\/\/www.eclipse.org\/ecf\u0022\u003EECF\u003C\/a\u003E\u0026nbsp;provides frameworks for messaging and inter-process communications. We fully implement the\u0026nbsp;\u003Ca href=\u0022https:\/\/wiki.eclipse.org\/ECF#OSGi_Remote_Services\u0022\u003EOSGi Remote Services\u003C\/a\u003E\u0026nbsp;(RS) and Remote Service Admin (RSA) standards.\u003C\/p\u003E\r\n\u003Cp\u003ESee \u003Ca href=\u0022http:\/\/wiki.eclipse.org\/ECF\u0022\u003Ethe ECF Wiki\u003C\/a\u003E for examples, tutorials, other documentation, as well as plans and efforts currently underway for future releases.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/ecf\/downloads.php","website":"http:\/\/www.eclipse.org\/ecf","overview":"http:\/\/projects.eclipse.org\/projects\/rt.ecf","offset":"1","new":false,"releases":[{"name":"3.8.0","description":"\u003Cp\u003EECF\u0026#39;s 3.8.0 release will focus on implementing the lastest OSGi specification for Remote Services (chapter 100 in OSGi Enterprise Specification) and Remote Service Admin (chapter 122 in OSGi Enterprise Specification). \u0026nbsp; The next OSGi specification (R6) is due for completion in March 2014. \u0026nbsp;The ECF 3.8+ releases will include a full and CT-compliant implementation of the R6 Remote Services and Remote Service Admin specifications. \u0026nbsp;ECF is the current reference implementation for the R6 RS\/RSA specifications.\u003C\/p\u003E\r\n\u003Cp\u003EIn addition to OSGi RS\/RSA implementation, we will add support for an MQTT-based protocol providers, as well as bug fixes, significant improvements to existing providers, new features for network discovery, new tutorials, examples, and documentation.\u003C\/p\u003E\r\n","subprojects":[],"date":1394424000}]},"technology.dltk":{"id":"technology.dltk","name":"Eclipse Dynamic Languages Toolkit","description":"\u003Cp\u003EThe Eclipse Dynamic Languages Toolkit (DLTK) is a tool for vendors, researchers, and end-users who rely on dynamic languages. DLTK is comprised of a set of extensible frameworks designed to reduce the complexity of building full featured development environments for dynamic languages such as PHP and Perl. Besides a set of frameworks DLTK provides exemplary Tcl, Ruby, and Python Integrated Development Environments ready to use out of the box.\u003C\/p\u003E\r\n","download":"http:\/\/download.eclipse.org\/technology\/dltk\/downloads\/","website":null,"overview":"http:\/\/projects.eclipse.org\/projects\/technology.dltk","offset":"2","new":false,"releases":[{"name":"5.0.0","description":null,"subprojects":[],"date":1372219200}]},"modeling.gmp.gmf-tooling":{"id":"modeling.gmp.gmf-tooling","name":"Eclipse GMF Tooling","description":"\u003Cp\u003EThe Eclipse GMF Tooling project provides a model-driven approach to generating graphical editors in the Eclipse IDE.\u003C\/p\u003E\r\n\u003Cp\u003EBy defining a tooling, graphical and mapping model definition, one can generate a fully functional graphical editor based on the Eclipse GMF Runtime.\u003C\/p\u003E\r\n\u003Cp\u003EFor more details, latest news, please visit new GMF-Tooling \u003Ca href=\u0022http:\/\/eclipse.org\/gmf-tooling\/\u0022\u003Ehome site\u003C\/a\u003E\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/modeling\/gmp\/downloads\/?project=gmf-tooling","website":"http:\/\/www.eclipse.org\/gmf-tooling","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.gmp.gmf-tooling","offset":"3","new":false,"releases":[{"name":"3.2.0","description":"\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.5;margin-top:0pt;margin-bottom:2pt;\u0022\u003E\u003Cspan id=\u0022docs-internal-guid-f14c3d3a-60e7-87aa-e7f7-60646d3f5153\u0022\u003E\u003Cspan style=\u0022font-family: Arial; color: rgb(0, 0, 0); background-color: transparent; vertical-align: baseline; white-space: pre-wrap;\u0022\u003EThis document describes the GMF Tooling 3.2.0 release in the Luna Simultaneous Release. \u003C\/span\u003E\u003C\/span\u003E\u003C\/p\u003E\r\n\u003Cp style=\u0022margin: 0px 0px 3px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003E\u0026nbsp;\u003C\/p\u003E\r\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.5;margin-top:0pt;margin-bottom:2pt;\u0022\u003E\u003Cspan id=\u0022docs-internal-guid-f14c3d3a-60e7-87aa-e7f7-60646d3f5153\u0022\u003E\u003Cspan style=\u0022font-family: Arial; color: rgb(0, 0, 0); background-color: transparent; vertical-align: baseline; white-space: pre-wrap;\u0022\u003EThis release focuses on the completing the switch of the GMF Tooling code generation templates to the Xtend2 template language, as a de-facto standard template language for the modern Eclipse modeling. \u003C\/span\u003E\u003C\/span\u003E\u003C\/p\u003E\r\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.5;margin-top:0pt;margin-bottom:2pt;\u0022\u003E\u003Cspan id=\u0022docs-internal-guid-f14c3d3a-60e7-87aa-e7f7-60646d3f5153\u0022\u003E\u003Cspan style=\u0022font-family: Arial; color: rgb(0, 0, 0); background-color: transparent; vertical-align: baseline; white-space: pre-wrap;\u0022\u003EAdopting the standard code-generation technology allows GMF Tooling user (toolsmith) to get access to the improved editing, debugging and performance features available in Xtend. \u003C\/span\u003E\u003C\/span\u003E\u003C\/p\u003E\r\n\u003Cp style=\u0022margin: 0px 0px 3px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003E\u0026nbsp;\u003C\/p\u003E\r\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.5;margin-top:0pt;margin-bottom:2pt;\u0022\u003E\u003Cspan id=\u0022docs-internal-guid-f14c3d3a-60e7-87aa-e7f7-60646d3f5153\u0022\u003E\u003Cspan style=\u0022font-family: Arial; color: rgb(0, 0, 0); background-color: transparent; vertical-align: baseline; white-space: pre-wrap;\u0022\u003EFor 3.2.0 release the new Xtend and old (GMF Tooling proprietary fork of Eclipse xPand) templates are delivered in parallel, aiming for generation of structurally identical code from the same input artifacts. \u003C\/span\u003E\u003C\/span\u003E\u003C\/p\u003E\r\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.5;margin-top:0pt;margin-bottom:2pt;\u0022\u003E\u003Cspan id=\u0022docs-internal-guid-f14c3d3a-60e7-87aa-e7f7-60646d3f5153\u0022\u003E\u003Cspan style=\u0022font-family: Arial; color: rgb(0, 0, 0); background-color: transparent; vertical-align: baseline; white-space: pre-wrap;\u0022\u003ESo toolsmith with significant amount of custom templates still have an option to decide on the time to migrate to the new language. \u003C\/span\u003E\u003C\/span\u003E\u003C\/p\u003E\r\n\u003Cp style=\u0022margin: 0px 0px 3px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003E\u0026nbsp;\u003C\/p\u003E\r\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.5;margin-top:0pt;margin-bottom:2pt;\u0022\u003E\u003Cspan id=\u0022docs-internal-guid-f14c3d3a-60e7-87aa-e7f7-60646d3f5153\u0022\u003E\u003Cspan style=\u0022font-family: Arial; color: rgb(0, 0, 0); background-color: transparent; vertical-align: baseline; white-space: pre-wrap;\u0022\u003EThe GMF Tooling release for Luna also aims to reduce the amount of the generated diagram code in favor of extending the set of base classes provided in the separate run-time component.\u003C\/span\u003E\u003C\/span\u003E\u003C\/p\u003E\r\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.5;margin-top:0pt;margin-bottom:2pt;\u0022\u003E\u003Cspan id=\u0022docs-internal-guid-f14c3d3a-60e7-87aa-e7f7-60646d3f5153\u0022\u003E\u003Cspan style=\u0022font-family: Arial; color: rgb(0, 0, 0); background-color: transparent; vertical-align: baseline; white-space: pre-wrap;\u0022\u003EIt also includes numerous bug fixes and improvements, including the optimizations of the runtime performance for the generated diagrams. \u0026nbsp;\u003C\/span\u003E\u003C\/span\u003E\u003C\/p\u003E\r\n\u003Cp style=\u0022margin: 0px 0px 3px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003E\u0026nbsp;\u003C\/p\u003E\r\n\u003Cp dir=\u0022ltr\u0022 style=\u0022line-height:1.5;margin-top:0pt;margin-bottom:2pt;\u0022\u003E\u003Cspan id=\u0022docs-internal-guid-f14c3d3a-60e7-87aa-e7f7-60646d3f5153\u0022\u003E\u003Cspan style=\u0022font-family: Arial; color: rgb(0, 0, 0); background-color: transparent; vertical-align: baseline; white-space: pre-wrap;\u0022\u003EThe release review is tracked by Bugzilla \u003C\/span\u003E\u003Ca href=\u0022https:\/\/bugs.eclipse.org\/bugs\/show_bug.cgi?id=435904\u0022 style=\u0022text-decoration:none;\u0022\u003E\u003Cspan style=\u0022font-family: Arial; color: rgb(17, 85, 204); background-color: transparent; text-decoration: underline; vertical-align: baseline; white-space: pre-wrap;\u0022\u003Ehttps:\/\/bugs.eclipse.org\/bugs\/show_bug.cgi?id=435904\u003C\/span\u003E\u003C\/a\u003E\u003Cspan style=\u0022font-family: Arial; color: rgb(0, 0, 0); background-color: transparent; vertical-align: baseline; white-space: pre-wrap;\u0022\u003E and the approved IP log is attached to that Bugzilla.\u003C\/span\u003E\u003C\/span\u003E\u003C\/p\u003E\r\n\u003Cp style=\u0022margin: 0px 0px 3px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003E\u0026nbsp;\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"rt.riena":{"id":"rt.riena","name":"Eclipse Riena","description":"\u003Cp\u003EThe Eclipse Riena platform is the foundation for building multi-tier enterprise client\/server applications. As such Riena is broadening the usage of the service oriented architecture of OSGi\/Equinox by providing access to local and remote services in a transparent way. Using this uniform programming model, the components of Riena and the business components of the enterprise application can be developed regardless of their target location. Components are later easily placed on client or server depending on the business requirements.\u003C\/p\u003E\r\n","download":"http:\/\/wiki.eclipse.org\/Riena_Getting_started","website":null,"overview":"http:\/\/projects.eclipse.org\/projects\/rt.riena","offset":"3","new":false,"releases":[{"name":"6.0.0","description":"\u003Cp\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-family: Arial, sans-serif; line-height: 16px;\u0022\u003EThis plan describes the work for Riena 6.0.0, which is planned for Jun 2014 (Luna release train). The overall goal is to investigate items where e4 and Riena can better integrate together. The E4 application model and the Riena navigation model.\u003C\/span\u003E\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.emf.query":{"id":"modeling.emf.query","name":"Eclipse EMF Query","description":"\u003Cp\u003EThis project has merged into the \u003Ca href=\u0022\/node\/11439\u0022\u003EEMF Services\u003C\/a\u003E project.\u003C\/p\u003E\r\n\u003Cp\u003EThe Eclipse EMF Query component facilitates the process of search and retrieval of model elements of interest in a flexible yet controlled and structured manner. Provides API support for the basic EObject based Condition objects that are used to formulate queries for EMF models.\u003C\/p\u003E\r\n\u003Cp\u003EThe query component provides the following classes\/interfaces to support queries.\u003C\/p\u003E\r\n\u003Col\u003E\r\n\t\u003Cli\u003E\r\n\t\tThe IEObjectSource interface provides the search scope elements to be used in a query.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tThe SELECT class implements a template-function that does the iteration over model elements and applies the search condition on each; it collects the resulting elements into a QueryResultSet object and returns it to the caller.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tThe FROM class represents the elements to search. It is responsible of providing an appropriate iterator for the elements in the search space.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tThe WHERE class applies the search conditions over the elements in the search set.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tThe UPDATE class passes the elements who satisfy the search condition to a caller-supplied modification function. It collects the modified elements into a QueryResultSet object and returns it to the caller.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tThe QueryResultSet class represents the set of elements returned by a given query.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tThe EObjectCondition class is the abstract parent of all conditions that deal with model-elements (i.e., EObjects). It incorporates the services of a PruneHandler in order to answers whether or not to prune the element tree at a specific element and thus ignore its children.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tThe ConditionPolicy class is used to allow the user to decide how to apply a given condition on a collection of a model-element EAttributes or EReferences values. Supports both the: exists (ANY) and for-all (ALL) semantics.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tThe EObjectStructuralFeatureValueCondition class is the parent class for conditions that are responsible for checking the values held in model-elements attributes or references.\u003C\/li\u003E\r\n\u003C\/ol\u003E\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/modeling\/emf\/downloads\/?project=query","website":"http:\/\/www.eclipse.org\/modeling\/emf\/?project=query","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.emf.query","offset":"2","new":false,"releases":[{"name":"1.8.0","description":"\u003Cp\u003EThis document describes the EMF Query 1.8.0 release in the Luna Simultaneous Release. This marks the ninth consecutive year that EMF Query has had a June release for the Eclipse Simultaneous Release. This is a minor maintenance release that maintains compatibility with the Eclipse platform and the other dependent projects in the yearly release.\u003C\/p\u003E\r\n\u003Cp\u003EThe release review record is at https:\/\/bugs.eclipse.org\/bugs\/show_bug.cgi?id=435818 and the approved IP log is attached to that Bugzilla.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"technology.packaging":{"id":"technology.packaging","name":"Eclipse Packaging Project","description":"\u003Cp\u003EThe objectives of the Eclipse Packaging project are to\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\t\u003Cb\u003ECreate entry level downloads based on defined user profiles.\u003C\/b\u003E The project defined and created the EPP downloads of Java Developer, Java EE Developer, C\/C++ Developer and RCP Developer. These downloads are available from the main Eclipse download page.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\t\u003Cb\u003EProvide a platform that allows the creation of packages (zip\/tar downloads) from an update site.\u003C\/b\u003E The core technology of the project will enable the creation of download packages that are created by bundling Eclipse features from one or multiple Eclipse update sites.\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n","download":"http:\/\/www.eclipse.org\/downloads","website":"http:\/\/www.eclipse.org\/epp\/","overview":"http:\/\/projects.eclipse.org\/projects\/technology.packaging","offset":"4","new":false,"releases":[{"name":"4.4.0","description":"\u003Cp\u003EEclipse EPP 4.4 is building the download packages for the \u003Ca href=\u0022http:\/\/wiki.eclipse.org\/Luna\u0022\u003ELuna Simultaneous Release\u003C\/a\u003E. In this release we increased the openness of the project, e.g. by simplifying the build process, introducing \u003Ca href=\u0022https:\/\/git.eclipse.org\/r\/#\/admin\/projects\/epp\/org.eclipse.epp.packages\u0022\u003EGerrit\u003C\/a\u003E code review, we migrated the build to \u003Ca href=\u0022https:\/\/www.eclipse.org\/tycho\/\u0022\u003ETycho\u003C\/a\u003E and \u003Ca href=\u0022http:\/\/eclipse.org\/cbi\/\u0022\u003ECBI\u003C\/a\u003E, we improved the user experience, e.g. by carefully adjusting default preferences and settings, and updated the logo and artwork.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"soa.bpel":{"id":"soa.bpel","name":"Eclipse BPEL Designer","description":"\u003Cp\u003EThe Eclipse BPEL Designer Project adds comprehensive support to Eclipse for the definition, authoring, editing, deploying, testing and debugging of WS-BPEL 2.0 processes. WS-BPEL (Web Services Business Process Execution Language), or BPEL, is a vendor-neutral specification being developed by \u003Ca href=\u0022http:\/\/docs.oasis-open.org\/wsbpel\/2.0\/wsbpel-specification-draft.html\u0022 target=\u0022oasis\u0022\u003EOASIS\u003C\/a\u003E to specify business processes as a set of interactions between web services.\u003C\/p\u003E\r\n","download":"http:\/\/download.eclipse.org\/bpel\/updates\/oxygen\/1.1.1\/","website":"http:\/\/eclipse.org\/bpel\/","overview":"http:\/\/projects.eclipse.org\/projects\/soa.bpel","offset":"2","new":false,"releases":[{"name":"1.0.4","description":"\u003Cp\u003EEclipse Luna simultaneous release.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"tools.pdt":{"id":"tools.pdt","name":"Eclipse PHP Development Tools","description":"\u003Cp\u003EThe PHP IDE project delivers a PHP Integrated Development Environment framework for the Eclipse platform. This project encompasses the development components necessary to develop PHP-based Web Applications and facilitates extensibility. It leverages the existing Web Tools Project in providing developers with PHP capabilities.\u003C\/p\u003E\r\n","download":"http:\/\/download.eclipse.org\/tools\/pdt\/downloads\/index.php","website":"http:\/\/www.eclipse.org\/pdt\/","overview":"http:\/\/projects.eclipse.org\/projects\/tools.pdt","offset":"2","new":false,"releases":[{"name":"3.3","description":"\u003Cp\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-family: Arial, Helvetica, sans-serif; line-height: 18px;\u0022\u003EThe PHP IDE project delivers a PHP Integrated Development Environment framework for the Eclipse platform. This project encompasses the development components necessary to develop PHP-based Web Applications and facilitates extensibility. It leverages the existing Web Tools Project in providing developers with PHP capabilities.\u003C\/span\u003E\u003Cbr style=\u0022color: rgb(0, 0, 0); font-family: Arial, Helvetica, sans-serif; line-height: 18px;\u0022 \/\u003E\r\n\t\u003Cspan style=\u0022color: rgb(0, 0, 0); font-family: Arial, Helvetica, sans-serif; line-height: 18px;\u0022\u003ERelease 3.3 is delivered for the Eclipse Luna simultaneous release.\u003C\/span\u003E\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"soa.bpmn2-modeler":{"id":"soa.bpmn2-modeler","name":"Eclipse BPMN2 Modeler Project","description":"\u003Cp\u003EThe mission of the \u003Ca href=\u0022http:\/\/www.eclipse.org\/projects\/project_summary.php?projectid=soa\u0022\u003ESOA Project\u003C\/a\u003E is to build frameworks and extensible tools that enable the design, configuration, assembly, deployment, monitoring, and management of software designed around a Service Oriented Architecture. The project is guided by the values of transparency, extensibility, vendor neutrality, community collaboration, agile development, and standards-based innovation.\u003C\/p\u003E\r\n\u003Cp\u003EThere has been a lot of interest recently in the BPMN 2.0 specification, and many feel that what UML is to object modeling, BPMN 2.0 will be to business process modeling and will become the de facto standard.\u003C\/p\u003E\r\n\u003Cp\u003EThe BPMN 2.0 Modeler provides a graphical modeling tool which allows creation and editing of BPMN ( \u003Ca href=\u0022http:\/\/www.bpmn.org\/\u0022\u003EBusiness Process Modeling Notation\u003C\/a\u003E ) diagrams. The tool is built on \u003Ca href=\u0022http:\/\/www.eclipse.org\/graphiti\u0022\u003EEclipse Graphiti\u003C\/a\u003E and uses the \u003Ca href=\u0022http:\/\/www.eclipse.org\/modeling\/mdt\/?project=bpmn2\u0022\u003EBPMN 2.0 EMF meta model\u003C\/a\u003E currently being developed within the Eclipse \u003Ca href=\u0022http:\/\/www.eclipse.org\/modeling\/mdt\/\u0022\u003EModel Development Tools\u003C\/a\u003E (MDT) project. This meta model is compatible with the \u003Ca href=\u0022http:\/\/www.omg.org\/spec\/BPMN\/2.0\/PDF\u0022\u003EBPMN 2.0 specification\u003C\/a\u003E (herafter \u0026quot;the specification\u0026quot;) proposed by the \u003Ca href=\u0022http:\/\/www.osoa.org\/display\/Main\/Home\u0022\u003EObject Management Group\u003C\/a\u003E.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/bpmn2-modeler\/downloads.php","website":"http:\/\/eclipse.org\/projects\/project.php?id=soa.bpmn2-modeler","overview":"http:\/\/projects.eclipse.org\/projects\/soa.bpmn2-modeler","offset":"2","new":true,"releases":[{"name":"1.1.0","description":"\u003Cp\u003EThis will be the first version of BPMN2 Modeler that will participate in the Eclipse simultaneous release train.\u003C\/p\u003E\r\n\u003Cp\u003EThe release is focused on improving BPMN 2.0 spec compliance as well as UI enhancements in the following areas:\u003C\/p\u003E\r\n\u003Cp\u003E1. Add support for BPMNLabel elements.\u003C\/p\u003E\r\n\u003Cp\u003E2. Improve usability of Choreography and Conversation elements.\u003C\/p\u003E\r\n\u003Cp\u003E3. Add extensions for model element presentation (color, font, linestyles, etc.)\u003C\/p\u003E\r\n\u003Cp\u003EIn order to accomplish 1. we have had to make some breaking API changes, and have taken the opportunity to clean up the code and refactor some classes.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.mdt.bpmn2":{"id":"modeling.mdt.bpmn2","name":"Eclipse Business Process Model and Notation (BPMN2)","description":"\u003Cp\u003EEclipse BPMN2 is an open source component of the Model Development Tools (MDT) subproject to provide a metamodel implementation based on the forthcoming Business Process Model and Notation (BPMN) 2.0 OMG specification.\u003C\/p\u003E\r\n","download":"http:\/\/download.eclipse.org\/modeling\/mdt\/bpmn2\/updates\/oxygen\/1.4.0","website":"http:\/\/www.eclipse.org\/modeling\/mdt\/?project=bpmn2","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.mdt.bpmn2","offset":"0","new":true,"releases":[{"name":"1.0","description":"\u003Cp\u003ELuna will be the first Eclipse release to include the MDT BPMN2 metamodel project. This project is required by the \u003Ca href=\u0022https:\/\/projects.eclipse.org\/projects\/soa.bpmn2-modeler\u0022\u003ESOA BPMN2 Modeler\u003C\/a\u003E project, which is also joining the Luna simultaneous release.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"technology.packaging.mpc":{"id":"technology.packaging.mpc","name":"Eclipse Marketplace Client","description":"\u003Cp\u003EThe Eclipse Marketplace Client provides a rich client for installing solutions listed on Eclipse Marketplace. MPC provides a workflow for finding and installing solutions, layering on top of the Eclipse P2 and providing a streamlined and simplified workflow that does not require users to enter and manage update sites.\u003C\/p\u003E\r\n","download":"https:\/\/www.eclipse.org\/mpc\/archive.php","website":"http:\/\/www.eclipse.org\/mpc","overview":"http:\/\/projects.eclipse.org\/projects\/technology.packaging.mpc","offset":"3","new":false,"releases":[{"name":"1.3","description":"\u003Cp\u003EThis release addresses specific concerns about MPC usability and significant bugs. It aims to make the installation process from the Eclipse Marketplace website via Drag\u0026amp;Drop more reliable across platforms and will provide improvements in the MPC UI.\u003C\/p\u003E\r\n\u003Cp\u003EFurther, a stable public API for the Marketplace Client is planned, that will offer both lower-level access to the information provided through the\u0026nbsp;\u003Ca href=\u0022http:\/\/wiki.eclipse.org\/Marketplace\/REST\u0022\u003EMarketplace REST API\u003C\/a\u003E, as well as higher-level access to discovery, search and install functions in the UI.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.emf.transaction":{"id":"modeling.emf.transaction","name":"Eclipse EMF Transaction","description":"\u003Cp\u003EThis project has merged into the \u003Ca href=\u0022\/node\/11439\u0022\u003EEMF Services\u003C\/a\u003E project.\u003C\/p\u003E\r\n\u003Cp\u003EThe transaction component provides the following capabilities.\u003C\/p\u003E\r\n\u003Col\u003E\r\n\t\u003Cli\u003E\r\n\t\tMulti-threading - Supports a protocol for clients to read and write EMF models on multiple threads.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tModel Integrity - Semantic integrity is ensured by automatic validation to detect invalid changes and semantic procedures to proactively maintain correctness of semantic dependencies.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tBatched Events - Clients are notified of groups of related changes in batches, rather than as a stream of EMF notifications. In particular, this allows applications to analyze change sets in their entirety.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tUndo\/Redo - For a simplified programming model, the API automatically tracks changes applied to models without the need for client code to use EMF edit Commands. These changes are encapsulated in transactions\/operations that can undo and redo themselves.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tEditing Domain - Support cooperative editing of models by multiple editors\/applications. EMF resources can be shared amongst different editing domains.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tEclipse Workspace - The API provides traceability between EMF resources and workspace resources. Multi-threaded access is coordinated via the Eclipse jobs API and its integration with the workspace.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tEclipse Operations - The API supports the Eclipse operation history as an undo stack for undo\/redo of resource changes. The API provides a framework for undoable operations that automatically capture undo\/redo information, which can be interleaved on the same history with dependent operations that do not modify the EMF model.\u003C\/li\u003E\r\n\u003C\/ol\u003E\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/modeling\/emf\/downloads\/?project=transaction","website":"http:\/\/www.eclipse.org\/modeling\/emf\/?project=transaction","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.emf.transaction","offset":"2","new":false,"releases":[{"name":"1.8.0","description":"\u003Cp\u003EThis document describes the EMF Transaction 1.8.0 release in the Luna Simultaneous Release. This marks the ninth consecutive year that EMF Transaction has had a June release for the Eclipse Simultaneous Release. This is a minor maintenance release that maintains compatibility with the Eclipse platform and the other dependent projects in the yearly release.\u003C\/p\u003E\r\n\u003Cp\u003E\u003Cbr \/\u003E\r\n\tThe release review is tracked by Bugzilla https:\/\/bugs.eclipse.org\/bugs\/show_bug.cgi?id=435821 and the approved IP log is attached to that Bugzilla.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"iot.paho":{"id":"iot.paho","name":"Eclipse Paho","description":"\u003Cp\u003EThe Paho project provides reliable open-source implementations of open and standard messaging protocols aimed at new, existing, and emerging applications for Machine-to-Machine (M2M) and Internet of Things (IoT).\u003C\/p\u003E\r\n\u003Cp\u003EPaho reflects the inherent physical and cost constraints of device connectivity. Its objectives include effective levels of decoupling between devices and applications, designed to keep markets open and encourage the rapid growth of scalable Web and Enterprise middleware and applications. Paho contains \u003Ca href=\u0022http:\/\/mqtt.org\u0022\u003EMQTT\u003C\/a\u003E publish\/subscribe client implementations for use on embedded platforms, along with corresponding server support as determined by the community.\u003C\/p\u003E\r\n","download":"https:\/\/www.eclipse.org\/paho\/downloads.php","website":"http:\/\/www.eclipse.org\/paho\/","overview":"http:\/\/projects.eclipse.org\/projects\/technology.paho","offset":"3","new":true,"releases":[{"name":"1.0.0 (Luna)","description":"\u003Cp\u003EThis is a simultaneous release with Luna, but not in the Luna repositories.\u0026nbsp;\u003C\/p\u003E\r\n\u003Cp\u003EThe Paho client libraries have been in use for several years now by IBM and Mosquitto, amongst others, predating the Paho project itself.\u0026nbsp; We consider them mature and suitable for production use, which is why we are proposing to graduate the project with this release.\u003C\/p\u003E\r\n\u003Cp\u003EThe main functional addition is the support of the latest version of the MQTT 3.1.1 specification, an OASIS standard.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.mmt.qvtd":{"id":"modeling.mmt.qvtd","name":"Eclipse QVTd (QVT Declarative)","description":"\u003Cp\u003EThe Eclipse QVT Declarative (QVTd) component is a partial implementation of the Core (QVTc) and Relations (QVTr) Languages defined by the \u003Ca href=\u0022http:\/\/www.omg.org\/spec\/QVT\u0022\u003EOMG standard specification (MOF) 2.0 Query\/View\/Transformation\u003C\/a\u003E.\u003C\/p\u003E\r\n\u003Cp\u003ETo date the QVT Declarative component provides editing capabilities to support the QVT Declarative Languages:\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\t0.7.0 (Helios) provides QVT models and \u003Ca href=\u0022http:\/\/sourceforge.net\/projects\/lpg\/\u0022\u003ELPG\u003C\/a\u003E based parsers\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\t0.8.0 (Indigo) adds \u003Ca href=\u0022http:\/\/www.eclipse.org\/imp\u0022\u003EIMP\u003C\/a\u003E-based editors.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\t0.9.0 (Juno) re-engineers the models and editors to exploit \u003Ca href=\u0022http:\/\/www.eclipse.org\/Xtext\u0022\u003EXtext\u003C\/a\u003E and the OCL Pivot model.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\t0.10.0 (Kepler) introduces editing and execution of the QVTi simplification of QVTc.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\t0.11.0 (Luna) introduces a source debugger for QVTi execution.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\t0.12.0 (Mars) provides a very preliminary Epsilon prototype of the QVTr to QVTc to QVTu to QVTm to QVTi chain.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\t0.13.0 (Neon) provides a preliminary QVTr to QVTc to QVTu to QVTm to QVTi chain.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\t[0.14.0 (Oxygen) will provide a more useable UMLX to QVTr to QVTc to QVTu to QVTm to QVTi chain and so full editing, compliation, execution, debugging.]\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n","download":"http:\/\/www.eclipse.org\/mmt\/downloads\/?project=qvtd","website":"http:\/\/www.eclipse.org\/mmt\/qvtd","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.mmt.qvtd","offset":"3","new":true,"releases":[{"name":"0.11.0","description":"\u003Cp\u003EThe new QVTi debugger extends the new OCL debugger.\u003C\/p\u003E\r\n\u003Cp\u003E(Addition of the QVTr\/QVTc to QVTi transformation chain next year should allow the project to graduate in Mars with Editor+Parser+Model+Executor+Debugger+CodeGenerator\u0026nbsp; for each language.)\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.eef":{"id":"modeling.eef","name":"Eclipse Extended Editing Framework (EEF)","description":"\u003Cp\u003EThe \u003Ca href=\u0022http:\/\/wiki.eclipse.org\/EEF\u0022\u003E Eclipse Extended Editing Framework\u003C\/a\u003E is a presentation framework for the \u003Ca href=\u0022http:\/\/www.eclipse.org\/modeling\/emf\/\u0022\u003EEclipse Modeling Framework\u003C\/a\u003E. It allows user to create rich user interfaces to edit EMF models.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/eef","website":"http:\/\/www.eclipse.org\/eef","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.eef","offset":"2","new":false,"releases":[{"name":"1.3.0","description":"\u003Cp\u003EThe 1.3.0 Release of the Extended Editing Framework will be focused on improving the user experience for editing emf models. On this purpose, new widgets will be added to the runtime. These widgets will improve model editing on two axis :\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\tNavigation through the model element\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tLook and feel\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\u003Cp\u003EAs for the other releases, the 1.3 version of EEF will provide a new set of bug fixes.\u003C\/p\u003E\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n","subprojects":[],"date":1386133200}]},"technology.koneki":{"id":"technology.koneki","name":"Koneki","description":"\u003Cp\u003EThe purpose of this project is to provide Machine-to-Machine solutions developers with tools easing the development, simulation, testing\/debugging and deployment of such solutions.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/koneki\/download.php","website":"http:\/\/www.eclipse.org\/koneki","overview":"http:\/\/projects.eclipse.org\/projects\/technology.koneki","offset":"3","new":false,"releases":[{"name":"1.1.0","description":"\u003Cp\u003EThe 1.1 version focuses on improving user-assistance for Lua Development Tools.\u0026nbsp;\u003C\/p\u003E\r\n","subprojects":[],"date":1387342800}]},"modeling.gmf-runtime":{"id":"modeling.gmf-runtime","name":"Eclipse GMF Runtime","description":"\u003Cp\u003EThe Eclipse GMF Runtime is an industry proven application framework for creating graphical editors using Eclipse EMF and Eclipse GEF.\u003C\/p\u003E\r\n\u003Cp\u003EThe GMF Runtime provides many features that one would have to code by hand if using EMF and GMF directly.\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\tA set of reusable components for graphical editors, such as printing, image export, actions and toolbars and much more.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tA standardized model to describe diagram elements, which separates between the semantic (domain) and notation (diagram) elements.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tA command infrastructure that bridges the different command frameworks used by EMF and GEF.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tAn extensible framework that allows graphical editors to be open and extendible.\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/modeling\/gmp\/downloads\/?project=gmf-runtime","website":"http:\/\/www.eclipse.org\/modeling\/gmp\/?project=gmf-runtime","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.gmf-runtime","offset":"3","new":false,"releases":[{"name":"1.8.0","description":"\u003Cdiv class=\u0022fieldset-wrapper\u0022\u003E\r\n\t\u003Cdiv class=\u0022field field-name-body field-type-text-with-summary field-label-hidden\u0022\u003E\r\n\t\t\u003Cdiv class=\u0022field-items\u0022\u003E\r\n\t\t\t\u003Cdiv class=\u0022field-item even\u0022\u003E\r\n\t\t\t\t\u003Cp\u003EThis document describes the GMF Runtime 1.8.0 release in the Luna Simultaneous Release. This marks the ninth consecutive year that GMF Runtime has had a June release for the Eclipse Simultaneous Release. This is a minor maintenance release that maintains compatibility with the Eclipse platform and the other dependent projects in the yearly release.\u003C\/p\u003E\r\n\t\t\t\t\u003Cp\u003EThe release review is tracked by Bugzilla https:\/\/bugs.eclipse.org\/bugs\/show_bug.cgi?id=435845 and the approved IP log is attached to that Bugzilla.\u003C\/p\u003E\r\n\t\t\t\u003C\/div\u003E\r\n\t\t\u003C\/div\u003E\r\n\t\u003C\/div\u003E\r\n\u003C\/div\u003E\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.gmf-notation":{"id":"modeling.gmf-notation","name":"Eclipse GMF Notation","description":"\u003Cp\u003EThe Eclipse GMF Notation Project provides a standard Eclipse EMF notational meta model.\u003C\/p\u003E\r\n\u003Cp\u003EThe notational meta model is a standard means for persisting diagram information separately from the domain model.\u003C\/p\u003E\r\n\u003Cp\u003EIt can also be used as a basis for diagram interchange and was based on the principles in the \u003Ca href=\u0022http:\/\/www.omg.org\/cgi-bin\/doc?formal\/06-04-04\u0022\u003EOMG Diagram Interchange Specification\u003C\/a\u003E\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/modeling\/gmp\/downloads\/?project=gmf-notation","website":null,"overview":"http:\/\/projects.eclipse.org\/projects\/modeling.gmp.gmf-notation","offset":"2","new":false,"releases":[{"name":"1.8.0","description":"\u003Cp\u003EThis document describes the GMF Notation 1.8.0 release in the Luna Simultaneous Release. This marks the ninth consecutive year that GMF Notation has had a June release for the Eclipse Simultaneous Release. This is a minor maintenance release that maintains compatibility with the Eclipse platform and the other dependent projects in the yearly release.\u003C\/p\u003E\r\n\u003Cp\u003EThe release review is tracked by Bugzilla https:\/\/bugs.eclipse.org\/bugs\/show_bug.cgi?id=435843 and the approved IP log is attached to that Bugzilla.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"tools.tm":{"id":"tools.tm","name":"Eclipse Target Management","description":"\u003Cp\u003EThe Eclipse Target Management project creates data models and frameworks to configure and manage remote systems, their connections, and their services. Our main offering is the Remote System Explorer (RSE), which is also part of the yearly Eclipse release train. It integrates any sort of heterogeneous remote resources under a single, consistent UI and allows transparent working on remote computers just like the local one. Besides that, it also provides access to remote file systems for other projects to consume via the Eclipse Filesystem (EFS).\u003C\/p\u003E\r\n\u003Cp\u003EAs a stand-alone offering, the project also provides a lightweight Terminal view.\u003C\/p\u003E\r\n","download":"http:\/\/download.eclipse.org\/tm\/downloads\/index.php","website":"http:\/\/www.eclipse.org\/tm\/","overview":"http:\/\/projects.eclipse.org\/projects\/tools.tm","offset":"1","new":false,"releases":[{"name":"3.6.0","description":"\u003Cp style=\u0022margin: 0px 0px 3px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003EThe Target Management Project provides data models, frameworks and tools for working with remote computer systems. The main deliverable is the Remote System Explorer (RSE), a feature-rich integrated perspective and toolkit for seamlessly working on remote systems. Besides that, we deliver flexible, re-usable components for Networking and Target Management that run stand-alone or integrated with RSE.\u003C\/p\u003E\r\n\u003Cp style=\u0022margin: 0px 0px 3px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003EIn terms of interfaces to other Eclipse projects, we provide an Eclipse Filesystem (EFS) provider to allow remote resources be mapped into an Eclipse Workspace. The DLTK and CDT projects are other Eclipse projects known to integrate with Target Management. PTP and PDT can use TM services via the underlying DLTK and CDT layers. Several Eclipse Packages include TM (The Eclipse for Web package, for instance, includes the TM Terminal).\u003C\/p\u003E\r\n\u003Cp style=\u0022margin: 0px 0px 3px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003EThe 3.6 release of TM provides the following features:\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli style=\u0022margin: 0px 0px 3px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003E\r\n\t\tSupport for \u0026ldquo;Copy \u0026amp; Paste\u0026rdquo; keyboard shortcuts added to Terminal as well as general support for handling keyboard shortcuts locally in Eclipse\u003C\/li\u003E\r\n\t\u003Cli style=\u0022margin: 0px 0px 3px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003E\r\n\t\tA number of stability and bug fixes\u003C\/li\u003E\r\n\t\u003Cli style=\u0022margin: 0px 0px 3px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003E\r\n\t\t\u003Cspan style=\u0022color: rgb(34, 34, 34); font-family: Arial, Verdana, sans-serif;\u0022\u003EAn upgraded build \u0026amp; releng system based on Maven \/ Tycho \/ CBI, along with a Hudson verification job and a HIPP instance, allowing for faster processing of inbound contributions and unittest verification of changes\u003C\/span\u003E\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n","subprojects":[],"date":1403668800}]},"technology.m2e.m2e-wtp":{"id":"technology.m2e.m2e-wtp","name":"Eclipse Maven Integration for Web Tools Platform","description":"\u003Cp\u003EThe Maven Integration for WTP project, also known as m2e-wtp, provides a tight integration between \u003Ca href=\u0022\/projects\/technology.m2e\u0022\u003EMaven Integration for Eclipse\u003C\/a\u003E (m2e) and the \u003Ca href=\u0022\/projects\/webtools\u0022\u003EEclipse Web Tools Project\u003C\/a\u003E (WTP). m2e-wtp provides a set of m2e connectors used for the configuration of Java EE projects in WTP, brings unique Maven features to your Eclipse IDE and helps you convert your Eclipse projects to Maven.\u003C\/p\u003E\r\n","download":"http:\/\/www.eclipse.org\/m2e-wtp\/download\/","website":"http:\/\/www.eclipse.org\/m2e-wtp\/","overview":"http:\/\/projects.eclipse.org\/projects\/technology.m2e.m2e-wtp","offset":"3","new":false,"releases":[{"name":"1.1.0","description":"\u003Cdiv style=\u0022margin: 0px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003E\r\n\tm2e-wtp aims at providing a tight integration between Apache Maven and Maven Integration for Eclipse (a.k.a\u0026nbsp;\u003Ca href=\u0022http:\/\/eclipse.org\/m2e\u0022 style=\u0022margin: 0px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: inherit; font-size: inherit; font-style: inherit; font-variant: inherit; font-weight: inherit; line-height: inherit; color: rgb(117, 60, 188);\u0022\u003Em2e\u003C\/a\u003E) on one hand and the Eclipse Web Tools Project (a.k.a\u0026nbsp;\u003Ca href=\u0022http:\/\/www.eclipse.org\/webtools\/\u0022 style=\u0022margin: 0px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: inherit; font-size: inherit; font-style: inherit; font-variant: inherit; font-weight: inherit; line-height: inherit; color: rgb(117, 60, 188);\u0022\u003EWTP\u003C\/a\u003E) on the other hand.\u003C\/div\u003E\r\n\u003Cdiv style=\u0022margin: 0px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003E\r\n\tIt provides a set of m2e connectors configuring Java EE projects in WTP, from their maven plugin configuration.\u003C\/div\u003E\r\n\u003Cdiv style=\u0022margin: 0px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003E\r\n\tm2e-wtp also brings some advanced Maven features to the IDE, such as dynamic resource filtering or war overlays.\u003C\/div\u003E\r\n\u003Cdiv style=\u0022margin: 0px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003E\r\n\t\u0026nbsp;\u003C\/div\u003E\r\n\u003Cdiv style=\u0022margin: 0px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003E\r\n\tm2e 1.1.0 is a maintenance release with a focus on bug fixes. The main new feature is the a\u003Cspan style=\u0022font-family: inherit; font-size: inherit; font-style: inherit; font-variant: inherit; font-weight: inherit; line-height: inherit;\u0022\u003Ebility to enable\/disable m2e-wtp entirely, either from Eclipse Preferences or from Maven properties defined in pom.xml. XML templates are provided for such properties in the pom editor. More details are available at\u0026nbsp;\u003C\/span\u003E\u003Cspan style=\u0022color: rgb(34, 34, 34); font-family: Arial, Verdana, sans-serif;\u0022\u003Ehttps:\/\/wiki.eclipse.org\/M2E-WTP\/New_and_Noteworthy\/1.1.0\u003C\/span\u003E\u003C\/div\u003E\r\n\u003Cdiv style=\u0022margin: 0px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003E\r\n\t\u0026nbsp;\u003C\/div\u003E\r\n\u003Cdiv style=\u0022margin: 0px; padding: 0px; border: 0px; outline: 0px; vertical-align: baseline; font-family: Arial, Helvetica, sans-serif; line-height: 18px; color: rgb(0, 0, 0);\u0022\u003E\r\n\t\u003Cspan style=\u0022font-family: inherit; font-size: inherit; font-style: inherit; font-variant: inherit; font-weight: inherit; line-height: inherit;\u0022\u003Em2e 1.1.0 requires m2e 1.5.0 and is compatible with Eclipse Kepler and Luna releases.\u003C\/span\u003E\u003C\/div\u003E\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"technology.m2e":{"id":"technology.m2e","name":"Eclipse Maven Integration","description":"\u003Cp\u003EThe goal of the m2e project is to provide a first-class Apache Maven support in the Eclipse IDE, making it easier to edit Maven\u0026#39;s pom.xml, run a build from the IDE and much more. For Java developers, the very tight integration with JDT greatly simplifies the consumption of Java artifacts either being hosted on open source repositories such as Maven Central, or in your in-house Maven repository.\u003C\/p\u003E\r\n","download":"http:\/\/eclipse.org\/m2e\/m2e-downloads.html","website":"http:\/\/www.eclipse.org\/m2e\/","overview":"http:\/\/projects.eclipse.org\/projects\/technology.m2e","offset":"2","new":false,"releases":[{"name":"1.5.0","description":"\u003Cp\u003EMajor improvements since 1.4\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\treduced memory footprint for workspace with large number of projects\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\treworked import maven project workflow\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tnew embedded maven runtime based on maven 3.2.1\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tnew http\/https transport based on okhttp\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tnew maven profile selection UI\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tability to set checksum validation level\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tnew Warning\/Error settings\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\u003Cp\u003Efull list of changes in 1.5.0\u003C\/p\u003E\r\n\u003Cp\u003Ehttps:\/\/bugs.eclipse.org\/bugs\/buglist.cgi?list_id=9255425\u0026amp;product=m2e\u0026amp;query_format=advanced\u0026amp;resolution=FIXED\u0026amp;target_milestone=1.5.0%2FLuna%20M1\u0026amp;target_milestone=1.5.0%2FLuna%20M2\u0026amp;target_milestone=1.5.0%2FLuna%20M3\u0026amp;target_milestone=1.5.0%2FLuna%20M4\u0026amp;target_milestone=1.5.0%2FLuna%20M5\u0026amp;target_milestone=1.5.0%2FLuna%20M6\u0026amp;target_milestone=1.5.0%2FLuna%20M7\u0026amp;target_milestone=1.5.0%2FLuna%20RC2\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"tools.cdt.tcf":{"id":"tools.cdt.tcf","name":"Eclipse Target Communication Framework","description":"\u003Cp\u003EEclipse TCF is a vendor-neutral, lightweight, extensible network protocol mainly for communicating with embedded systems (targets). Its most distinguishing feature is that TCF is designed to transparently plug in value-adding servers between the tool and the target. But even without value-add, the protocol has the potential to unify lots of currently independent communication links, thus saving resources and making setup and configuration much easier than in current embedded development scenarios.\u003C\/p\u003E\r\n","download":"http:\/\/eclipse.org\/tcf\/downloads.php","website":"http:\/\/www.eclipse.org\/tcf","overview":"http:\/\/projects.eclipse.org\/projects\/tools.cdt.tcf","offset":"2","new":false,"releases":[{"name":"1.2.0","description":"\u003Cp\u003ETCF 1.2 is delivered for the Eclipse Luna simultaneous release. This is a minor release with no API changes allowed. The release is focused on robustness and improved test coverage, to support commercial adoption of the TCF Debugger. In addition to that, the \u0026quot;TCF Terminal (Console) View\u0026quot; has been productized providing an Eclipse-embedded commandline on Windows, Linux and MacOS X.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"technology.xwt":{"id":"technology.xwt","name":"Eclipse XWT","description":"\u003Cp\u003EEclipse XWT is a powerful declarative UI in XML for Eclipse. It is a thin layer of markup language by unifying Eclipse SWT\/JIFace and Eclipse JFace Databinding in one.\u003C\/p\u003E\r\n\u003C!--break--\u003E\r\n\u003Cp\u003EIt simplifies the UI development in Eclipse and open a door to provide more tools such as:\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\tVisual editing using \u003Ca href=\u0022http:\/\/www.eclipse.org\/windowbuilder\/\u0022\u003EWindows Builder\u003C\/a\u003E\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tModel Driven UI. \u003Ca href=\u0022http:\/\/www.eclipse.org\/papyrus\/\u0022\u003EPapyrus\u003C\/a\u003E uses XWT to generate the \u0026quot;Properties View\u0026quot; for UML model editing.\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n","download":null,"website":null,"overview":"http:\/\/projects.eclipse.org\/projects\/technology.xwt","offset":"0","new":true,"releases":[{"name":"1.0.0","description":"\u003Cp\u003EThis release fixes some bugs observed in 0.11.0 and integrates a new plugin org.eclipse.xwt.ui.workbench.\u003C\/p\u003E\r\n\u003Cp\u003EHere are the bugs fixed.\u0026nbsp;\u003C\/p\u003E\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\t\u003Cspan style=\u0022font-family:arial,helvetica,sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:11px;\u0022\u003E\u003Ca href=\u0022https:\/\/bugs.eclipse.org\/bugs\/show_bug.cgi?id=425401\u0022 style=\u0022color: rgb(102, 51, 102); font-family: Verdana, sans-serif; font-size: 16px; font-weight: bold;\u0022\u003E\u003Cb\u003EBug\u0026nbsp;425401\u003C\/b\u003E\u003C\/a\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-weight: bold; background-color: rgb(208, 208, 208);\u0022\u003E\u0026nbsp;-\u003C\/span\u003E\u003Cspan id=\u0022summary_alias_container\u0022 style=\u0022color: rgb(0, 0, 0); font-weight: bold;\u0022\u003E\u0026nbsp;\u003Cspan id=\u0022short_desc_nonedit_display\u0022\u003E[EMF] List data binding is not observed correct with EMF model\u003C\/span\u003E\u003C\/span\u003E\u003C\/span\u003E\u003C\/span\u003E\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\t\u003Cspan style=\u0022font-family:arial,helvetica,sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:11px;\u0022\u003E\u003Ca href=\u0022https:\/\/bugs.eclipse.org\/bugs\/show_bug.cgi?id=430635\u0022 style=\u0022color: rgb(102, 51, 102); font-family: Verdana, sans-serif; font-size: 16px; font-weight: bold;\u0022\u003E\u003Cb\u003EBug\u0026nbsp;430635\u003C\/b\u003E\u003C\/a\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-weight: bold; background-color: rgb(208, 208, 208);\u0022\u003E\u0026nbsp;-\u003C\/span\u003E\u003Cspan id=\u0022summary_alias_container\u0022 style=\u0022color: rgb(0, 0, 0); font-weight: bold;\u0022\u003E\u0026nbsp;\u003Cspan id=\u0022short_desc_nonedit_display\u0022\u003EThe IDataProvider doesn\u0026#39;t work as expected.\u003C\/span\u003E\u003C\/span\u003E\u003C\/span\u003E\u003C\/span\u003E\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\t\u003Cspan style=\u0022font-family:arial,helvetica,sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:11px;\u0022\u003E\u003Ca href=\u0022https:\/\/bugs.eclipse.org\/bugs\/show_bug.cgi?id=425326\u0022 style=\u0022color: rgb(102, 51, 102); font-family: Verdana, sans-serif; font-size: 16px; font-weight: bold;\u0022\u003E\u003Cb\u003EBug\u0026nbsp;425326\u003C\/b\u003E\u003C\/a\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-weight: bold; background-color: rgb(208, 208, 208);\u0022\u003E\u0026nbsp;-\u003C\/span\u003E\u003Cspan id=\u0022summary_alias_container\u0022 style=\u0022color: rgb(0, 0, 0); font-weight: bold;\u0022\u003E\u0026nbsp;\u003Cspan id=\u0022short_desc_nonedit_display\u0022\u003ESupport of Read only property in bean model\u003C\/span\u003E\u0026nbsp;\u003C\/span\u003E\u003C\/span\u003E\u003C\/span\u003E\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\t\u003Cspan style=\u0022font-family:arial,helvetica,sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:11px;\u0022\u003E\u003Ca href=\u0022https:\/\/bugs.eclipse.org\/bugs\/show_bug.cgi?id=425376\u0022 style=\u0022color: rgb(102, 51, 102); font-family: Verdana, sans-serif; font-size: 16px; font-weight: bold;\u0022\u003E\u003Cb\u003EBug\u0026nbsp;425376\u003C\/b\u003E\u003C\/a\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-weight: bold; background-color: rgb(208, 208, 208);\u0022\u003E\u0026nbsp;-\u003C\/span\u003E\u003Cspan id=\u0022summary_alias_container\u0022 style=\u0022color: rgb(0, 0, 0); font-weight: bold;\u0022\u003E\u0026nbsp;\u003Cspan id=\u0022short_desc_nonedit_display\u0022\u003ENPE when the columns list is empty in table\u003C\/span\u003E\u0026nbsp;\u003C\/span\u003E\u003C\/span\u003E\u003C\/span\u003E\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\t\u003Cspan style=\u0022font-family:arial,helvetica,sans-serif;\u0022\u003E\u003Cspan style=\u0022font-size:11px;\u0022\u003E\u003Ca href=\u0022https:\/\/bugs.eclipse.org\/bugs\/show_bug.cgi?id=425450\u0022 style=\u0022color: rgb(102, 51, 102); font-family: Verdana, sans-serif; font-size: 16px; font-weight: bold;\u0022\u003E\u003Cb\u003EBug\u0026nbsp;425450\u003C\/b\u003E\u003C\/a\u003E\u003Cspan style=\u0022color: rgb(0, 0, 0); font-weight: bold; background-color: rgb(208, 208, 208);\u0022\u003E\u0026nbsp;-\u003C\/span\u003E\u003Cspan id=\u0022summary_alias_container\u0022 style=\u0022color: rgb(0, 0, 0); font-weight: bold;\u0022\u003E\u0026nbsp;\u003Cspan id=\u0022short_desc_nonedit_display\u0022\u003EStackOverflow in Table loading.\u003C\/span\u003E\u003C\/span\u003E\u003C\/span\u003E\u003C\/span\u003E\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n\u003Cp\u003EThe purpose of the new plugin is to simplify UI development with Eclipse workbench. Precisely, it provides necessary classes to load UI in XWT resource file in eclipse workbench parts:\u003C\/p\u003E\r\n\u003Cul\u003E\r\n\t\u003Cli\u003E\r\n\t\tStatic View Part\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tDynmaic View Part\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tDialog\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tWizard\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tProperties View\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tEditor\u0026nbsp;\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\u003Cp\u003EThis plugin is provided in a delegated feature titled as \u0026quot;XWT Eclipse Workbench Integration\u0026quot;.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]},"modeling.emf.validation":{"id":"modeling.emf.validation","name":"Eclipse EMF Validation","description":"\u003Cp\u003EThis project has merged into the \u003Ca href=\u0022\/node\/11439\u0022\u003EEMF Services\u003C\/a\u003E project.\u003C\/p\u003E\r\n\u003Cp\u003EThe Eclipse EMF Validation component provides the following capabilities.\u003C\/p\u003E\r\n\u003Col\u003E\r\n\t\u003Cli\u003E\r\n\t\tConstraint Definition - Provides API for defining constraints for any EMF meta-model (batch and live constraints).\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tCustomizable model traversal algorithms - Extensibility API to support meta-models that require custom strategies for model traversal.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tConstraint parsing for languages - Provides support for parsing the content of constraint elements defined in specific languages. The validation framework provides support for two languages: Java and OCL.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tConfigurable constraint bindings to application contexts - API support to define \u0026quot;client contexts\u0026quot; that describe the objects that need to be validated and to bind them to constraints that need to be enforced on these objects.\u003C\/li\u003E\r\n\t\u003Cli\u003E\r\n\t\tValidation listeners - Support for listening to validation events.\u003C\/li\u003E\r\n\u003C\/ol\u003E\r\n","download":"http:\/\/www.eclipse.org\/modeling\/emf\/downloads\/?project=validation","website":"http:\/\/www.eclipse.org\/modeling\/emf\/?project=validation","overview":"http:\/\/projects.eclipse.org\/projects\/modeling.emf.validation","offset":"2","new":false,"releases":[{"name":"1.8.0","description":"\u003Cp\u003EThis document describes the EMF Validation 1.8.0 release in the Luna Simultaneous Release. This marks the ninth consecutive year that EMF Validation has had a June release for the Eclipse Simultaneous Release. This is a minor maintenance release that maintains compatibility with the Eclipse platform and the other dependent projects in the yearly release.\u003C\/p\u003E\r\n\u003Cp\u003EThe release review is tracked by Bugzilla https:\/\/bugs.eclipse.org\/bugs\/show_bug.cgi?id=435822 and the approved IP log is attached to that Bugzilla.\u003C\/p\u003E\r\n","subprojects":[],"date":1403668800}]}}}}